Repository: wladradchenko/wunjo.wladradchenko.ru
Catalog: portable/src/wunjo/translations/*/LC_MESSAGES/messages.po
Languages: es, ru

source: Yikes! Looks like an alien format. Stick to images or videos for now.
es: ¡Vaya! Parece un formato alienígena. Quédate con imágenes o videos por ahora.
ru: Ой! Похоже на инопланетный формат. Пока придерживайтесь изображений или видео.

source: enhancement
es: mejora
ru: улучшение качества

source: Method
es: Método
ru: Метод

source: Resized to
es: Redimensionado a
ru: Размер

source: Enhance faces and details with Gfpgan. This powerful tool refines facial features and improves overall video quality. It adds realism and sharpness, making your videos stand out with vivid detail and lifelike appearance.
es: Mejora las caras y los detalles con Gfpgan. Esta poderosa herramienta refina las características faciales y mejora la calidad general del video. Añade realismo y nitidez, haciendo que tus videos se destaquen con detalles vívidos y apariencia realista.
ru: Улучшите лица и детали с помощью Gfpgan. Этот мощный инструмент совершенствует черты лица и улучшает общее качество видео. Он добавляет реалистичность и четкость, делая ваши видео яркими и живыми.

source: Face boost
es: Mejora de rostro
ru: Улучшение лица

source: Anime enhance
es: Mejora de anime
ru: Улучшение аниме

source: Activate Animesgan to enhance anime-like videos. This innovative feature clarifies lines and colors, bringing out the artistic essence of your videos. It smooths transitions and enhances visual clarity, ensuring your anime-style content looks its best.
es: Activa Animesgan para mejorar videos estilo anime. Esta innovadora función aclara las líneas y los colores, resaltando la esencia artística de tus videos. Suaviza las transiciones y mejora la claridad visual, asegurando que tu contenido de estilo anime luzca lo mejor posible.
ru: Активируйте Animesgan для улучшения видео в стиле аниме. Инновационная функция уточняет линии и цвета, подчеркивая художественную сущность ваших видео. Она сглаживает переходы и улучшает визуальную четкость, гарантируя, что ваш контент в стиле аниме будет выглядеть наилучшим образом.

source: Real video
es: Video real
ru: Реальное видео

source: Enable Realesrgan for real-life video enhancement. This advanced tool smoothens and clarifies videos, removing noise and enhancing overall quality. It’s perfect for video and improving visual appeal with crisp details and smooth playback.
es: Habilita Realesrgan para mejorar videos reales. Esta herramienta avanzada suaviza y aclara videos, eliminando el ruido y mejorando la calidad general. Es perfecta para mejorar la apariencia visual de los videos con detalles nítidos y reproducción fluida.
ru: Включите Realesrgan для улучшения реальных видео. Этот продвинутый инструмент сглаживает и уточняет видео, удаляя шум и повышая общее качество. Это идеально для улучшения визуальной привлекательности видео с четкими деталями и плавным воспроизведением.

source: Wow! Seems like you didn’t pick a face in your content witch need to swap. Click on the «Find face» button and set box on person face, please!
es: ¡Vaya! Parece que no seleccionaste un rostro en tu contenido para cambiar. Haz clic en el botón «Encontrar rostro» y marca el rostro de la persona, ¡por favor!
ru: Ух ты! Похоже, вы не выбрали лицо в вашем контенте, которое нужно заменить. Нажмите кнопку «Найти лицо» и установите рамку на лицо человека, пожалуйста!

source: Param Pam Pam! It seems like your avatar’s face is feeling a bit missed! Give that «Upload avatar» button a click and upload a face with some personality!
es: ¡Param Pam Pam! Parece que el rostro de tu avatar se siente un poco perdido. ¡Haz clic en el botón «Subir avatar» y carga un rostro con algo de personalidad!
ru: Парам-пам-пам! Похоже, что лицо вашего аватара немного потеряно! Нажмите кнопку «Загрузить аватар» и загрузите лицо с характером!

source: Uh-oh! The width looks wonky. Double-check it’s a number and not empty. Maybe click on «Select object» or load another file.
es: ¡Ups! El ancho parece raro. Verifica que sea un número y no esté vacío. Tal vez haz clic en «Seleccionar objeto» o carga otro archivo.
ru: Упс! Ширина выглядит странно. Убедитесь, что это число, а не пустое значение. Возможно, нажмите «Выбрать объект» или загрузите другой файл.

source: Pick face to swap. Select start and end for seamless changes. No cutting, just smooth transitions. Easy!
es: Elige el rostro para cambiar. Selecciona el inicio y el final para cambios suaves. ¡Nada de cortes, solo transiciones suaves! ¡Fácil!
ru: Выберите лицо для замены. Установите начало и конец для плавных изменений.

source: Upload photo, craft avatar, choose face to swap. You’re a sculptor of non-existent personas. Done!
es: Sube una foto, crea un avatar, elige un rostro para cambiar. ¡Eres un escultor de personas inexistentes! ¡Listo!
ru: Загрузите фото или сгенерируйте, выберите лицо для замены. Вы скульптор несуществующих персонажей.

source: Got a sneaky suspicion about some content? Ready to sniff out those deepfakes? Just hit that button.
es: ¿Tienes una sospecha sobre algún contenido? ¿Listo para descubrir esos deepfakes? Solo presiona ese botón.
ru: Есть подозрение насчет контента? Готовы обнаружить дипфейки? Просто нажмите анализировать.

source: Gemini faces detection
es: Detección de rostros gemelos
ru: Найти близнецов

source: Replace all detected faces
es: Reemplazar todos los rostros detectados
ru: Заменить все лица

source: Find face
es: Encontrar rostro
ru: Найти лицо

source: Upload avatar
es: Subir avatar
ru: Загрузить аватар

source: Aspect ratio
es: Relación de aspecto
ru: Соотношение сторон

source: Frames per second
es: Cuadros por segundo
ru: Кадры в секунду

source: Reduce control strength to less depend to frames.
es: Reduce la fuerza de control para depender menos de los cuadros.
ru: Уменьшите силу управления, чтобы меньше зависеть от кадров.

source: Increase control strength to up depend to frames.
es: Aumenta la fuerza de control para depender más de los cuadros.
ru: Увеличьте силу управления, чтобы больше зависеть от кадров.

source: A stuffed animal donkey grazing in a valley
es: Un muñeco de peluche de burro pastando en un valle
ru: Мягкая игрушка осел, пасущийся в долине

source: Cinematic, sunny day, waves crashing on the shore of a beach
es: Cinemático, día soleado, olas rompiendo en la orilla de la playa
ru: Кинематографично, солнечный день, волны разбиваются о берег пляжа

source: A cow grazing in a valley during the day, a UFO approaches in the distance
es: Una vaca pastando en un valle durante el día, un OVNI se acerca en la distancia
ru: Корова пасется в долине днем, вдалеке приближается НЛО

source: A flower blooming in slow motion
es: Una flor abriéndose en cámara lenta
ru: Цветок, раскрывающийся в замедленной съемке

source: 3D render, a raccoon holding a mini ice cream cone
es: Renderizado 3D, un mapache sosteniendo un mini cucurucho de helado
ru: 3D рендер, енот, держащий мини-вафельный рожок с мороженым

source: POV of a car driving in outer space traveling through time, time travel tunnel
es: Perspectiva de un automóvil conduciendo en el espacio exterior viajando a través del tiempo, túnel del tiempo
ru: От первого лица, автомобиль, едущий в космосе и путешествующий во времени, туннель времени

source: 2 cats in love eating a candlelit dinner of fresh fish
es: 2 gatos enamorados comiendo una cena a la luz de las velas con pescado fresco
ru: 2 кошки влюблены, едят ужин при свечах из свежей рыбы

source: Cinematic, a dog in a car window
es: Cinemático, un perro en la ventana de un coche
ru: Кинематографично, собака в окне машины

source: Moody, filmic, 35mm, a doctor walking into the hospital
es: Con tono melancólico, cinematográfico, 35mm, un médico caminando hacia el hospital
ru: Настроенчески, фильмовая съемка, 35мм, врач идет в больницу

source: 3D render, goldfish swimming in a glass container
es: Renderizado 3D, un pez dorado nadando en un recipiente de vidrio
ru: 3D рендер, золотая рыбка, плавающая в стеклянной емкости

source: Nature documentary, jellyfish swimming in the ocean
es: Documental de naturaleza, medusas nadando en el océano
ru: Природный документальный фильм, медузы, плавающие в океане

source: Cinematic, a Tibetan monk sitting in a temple on a mountain, facing camera.
es: Cinemático, un monje tibetano sentado en un templo en una montaña, mirando hacia la cámara.
ru: Кинематографично, тибетский монах, сидящий в храме на горе, лицом к камере.

source: Nature documentary, natural lighting, flamingo walking in a beautiful beach, head turning
es: Documental de naturaleza, luz natural, un flamenco caminando por una hermosa playa, girando la cabeza
ru: Природный документальный фильм, естественное освещение, фламинго идет по красивому пляжу, поворачивая голову

source: Low angle dolly in shot, a wild west town with saloons and dusty streets
es: Toma con ángulo bajo, un pueblo del salvaje oeste con salones y calles polvorientas
ru: Съемка с низкого угла, дикая западная деревня с салунами и пыльными улицами

source: A secret garden with a rainbow waterfall
es: Un jardín secreto con una cascada arcoíris
ru: Тайный сад с радужным водопадом

source: Cinematic, a cowboy riding a horse on mirror-like lake, moving clouds
es: Cinemático, un vaquero montando un caballo en un lago como un espejo, con nubes en movimiento
ru: Кинематографично, ковбой, едущий на лошади по озеру, как зеркало, с движущимися облаками

source: Cinematic, long tracking shot of the cliffs of Dover
es: Cinemático, una toma larga siguiendo los acantilados de Dover
ru: Кинематографично, длинный следящий кадр скал Дувра

source: 1950s film style, a seagull on a boat
es: Estilo de película de los 1950, una gaviota en un bote
ru: Фильм 1950-х, чайка на лодке

source: A woman smiling while watching fireworks
es: Una mujer sonriendo mientras mira los fuegos artificiales
ru: Женщина улыбается, смотря на фейерверки

source: Beautiful sunset at the beach, silhouette of a couple walking by the seashore against sunset, beautiful scenery
es: Hermoso atardecer en la playa, silueta de una pareja caminando junto a la orilla contra el atardecer, hermoso paisaje
ru: Красивый закат на пляже, силуэт пары, идущей вдоль берега на фоне заката, красивый пейзаж

source: Anime, a boy and a girl sitting on the grass under the starry sky
es: Anime, un niño y una niña sentados en la hierba bajo el cielo estrellado
ru: Аниме, мальчик и девочка сидят на траве под звездным небом

source: Nature documentary, close up of a lizard in a desert
es: Documental de naturaleza, primer plano de una lagartija en el desierto
ru: Природный документальный фильм, крупный план ящерицы в пустыне

source: 1940s newsreel footage, a soldier stands watch on a rocky hill, facing camera
es: Imágenes de noticiero de los 1940, un soldado haciendo guardia en una colina rocosa, mirando hacia la cámara
ru: Новостные кадры 1940-х, солдат стоит на посту на каменистом холме, лицом к камере

source: Anime, a woman walking home with groceries, wide angle
es: Anime, una mujer caminando a casa con víveres, ángulo amplio
ru: Аниме, женщина идет домой с продуктами, широкоугольный кадр

source: Watercolor style of a baby elephant drinking water from a lake in the desert
es: Estilo acuarela, un elefante bebé bebiendo agua de un lago en el desierto
ru: Акварельный стиль, детеныш слона пьет воду из озера в пустыне

source: Futuristic film of a man walking on a street in Paris, cinematic, symmetric composition
es: Película futurista de un hombre caminando por una calle en París, cinemática, composición simétrica
ru: Футуристический фильм о человеке, идущем по улице в Париже, кинематографичный, симметричный состав

source: Claymation, stop motion, a rat sitting on a huge block of cheese
es: Claymation, stop motion, una rata sentada en un enorme trozo de queso
ru: Клеймейшн, покадровая анимация, крыса сидит на огромном куске сыра

source: It’s like describe a genie your wishes so they can conjure up just what you need!
es: ¡Es como describirle a un genio tus deseos para que pueda conjurar justo lo que necesitas!
ru: Опишите его так, как будто описываете джину свои желания, чтобы он сотворил именно то, что вам нужно!

source: (Optional) Describe your prompt for generation, or leave it blank for a random request. You can use (word) to emphasize specific requests and word:non-integers number from 0 to 1 for request intensity. For example, dog:0.8, cat:0.2 in one prompt. The maximum number of symbols is 3000.
es: (Opcional) Describe tu solicitud para la generación, o déjala en blanco para una solicitud aleatoria. Puedes usar (palabra) para enfatizar solicitudes específicas y palabra:números-no-enteros de 0 a 1 para la intensidad de la solicitud. Por ejemplo, dog:0.8, cat:0.2 en una solicitud. El número máximo de símbolos es 3000.
ru: (Опционально) Опишите свой запрос для генерации или оставьте его пустым для случайного запроса. Вы можете использовать (слово) для акцента на определенных запросах и слово:нецелые числа от 0 до 1 для интенсивности запроса. Например, dog:0.8, cat:0.2 в одном запросе. Максимальное количество символов — 3000.

source: Ready to have some fun? Complete the image and add new elements.
es: ¿Listo para divertirte? Completa la imagen y agrega nuevos elementos.
ru: Готовы повеселиться? Завершите изображение и добавьте новые элементы.

source: Something wrong...During create task. Tap on the screen to view details.
es: Algo salió mal... Durante la creación de la tarea. Toca en la pantalla para ver detalles.
ru: Что-то пошло не так... При создании задачи. Нажмите на экран, чтобы увидеть детали.

source: Authorization failed. Access is available only with a subscription. Please review available plans and any discounts.
es: Error de autorización. El acceso está disponible solo con suscripción. Por favor, revisa los planes disponibles y los descuentos.
ru: Ошибка авторизации. Доступ доступен только с подпиской. Пожалуйста, ознакомьтесь с доступными планами и возможными скидками.

source: Is not valid format.
es: El formato no es válido.
ru: Некорректный формат.

source: Image will be generate.
es: La imagen será generada.
ru: Изображение будет сгенерировано.

source: Oops! Something went wrong. Please click submit again after some time. Tap on the screen to view details.
es: ¡Ups! Algo salió mal. Por favor, haga clic en enviar nuevamente después de un tiempo. Toque en la pantalla para ver detalles.
ru: Ой! Что-то пошло не так. Пожалуйста, нажмите «Отправить» снова через некоторое время. Нажмите на экран, чтобы увидеть детали.

source: Oops! An unexpected error occurred. Tap on the screen to view details.
es: ¡Ups! Ocurrió un error inesperado. Toque en la pantalla para ver detalles.
ru: Ой! Произошла непредвиденная ошибка. Нажмите на экран, чтобы увидеть детали.

source: generation
es: generación
ru: генерация контента

source: Wow! Seems like you didn’t pick a face in your content witch need to animate. Click on the «Find face» button and set box on person face, please!
es: ¡Vaya! Parece que no seleccionaste una cara en tu contenido para animar. Haz clic en el botón «Buscar cara» y selecciona la cara de la persona, por favor.
ru: Ух ты! Похоже, вы не выбрали лицо на вашем контенте для анимации. Нажмите кнопку «Найти лицо» и обведите лицо человека, пожалуйста!

source: Hmm... The height seems fishy. Verify it’s a number and not empty. Check it’s a number and not empty. Maybe click on «Select object» or load another file.
es: Hmm... La altura parece sospechosa. Verifica que sea un número y no esté vacío. Tal vez haz clic en «Seleccionar objeto» o carga otro archivo.
ru: Хмм... Высота кажется подозрительной. Проверьте, что это число, а не пустое значение. Возможно, нажмите «Выбрать объект» или загрузите другой файл.

source: Overlay audio
es: Superponer audio
ru: Наложить аудио

source: Smooth defects
es: Suavizar defectos
ru: Сгладить дефекты

source: Pick face to animate. Select start and end for seamless changes. No cutting, just smooth transitions. Easy!
es: Selecciona una cara para animar. Establece el inicio y el final para cambios suaves. Sin cortes, solo transiciones suaves. ¡Fácil!
ru: Выберите лицо для анимации. Установите начало и конец для плавных изменений.

source: For best results, use in Lip Sync a high-quality audio without noise.
es: Para obtener los mejores resultados, usa un audio de alta calidad sin ruido en la sincronización de labios.
ru: Для наилучших результатов синхронизации губ используйте аудио без шума.

source: lip sync
es: sincronización de labios
ru: синхронизации губ

source: Expression
es: Expresión
ru: Выражение

source: Head pose
es: Posición de la cabeza
ru: Голова

source: Lip
es: Labios
ru: Губы

source: Eyes
es: Ojos
ru: Глаза

source: Animate
es: Animar
ru: Анимировать

source: Pick face to live. Select start and end for seamless changes. No cutting, just smooth transitions. Easy!
es: Selecciona una cara para animar en vivo. Establece el inicio y el final para cambios suaves. Sin cortes, solo transiciones suaves. ¡Fácil!
ru: Выберите лицо для анимации. Установите начало и конец для плавных изменений.

source: Upload avatar video to repeat movement. You’re a sculptor of non-existent personas. Done!
es: Sube un video de avatar para repetir el movimiento. Eres un escultor de personas inexistentes. ¡Listo!
ru: Загрузите видео с лицом для повторения движения. Вы скульптор несуществующих движений.

source: Manually retargeting
es: Reasignación manual
ru: Ручная обработка

source: Wow! Somthing went wrong. Because of scenes can not be empty. Please try another file.
es: ¡Vaya! Algo salió mal. Las escenas no pueden estar vacías. Por favor, prueba con otro archivo.
ru: Ух ты! Что-то пошло не так. Сцены не могут быть пустыми. Пожалуйста, попробуйте другой файл.

source: Scanning...
es: Escaneando...
ru: Сканирование...

source: Blinking
es: Parpadeo
ru: Моргание

source: Silent
es: Silencio
ru: Тишина

source: Nodding
es: Asintiendo
ru: Кивание

source: Shaking
es: Sacudida
ru: Покачивание

source: Flirt
es: Coqueteo
ru: Флирт

source: Yikes! Looks like an alien format. Stick to videos or image for now.
es: ¡Vaya! Parece un formato alienígena. Por ahora, usa videos o imágenes.
ru: Ух ты! Похоже, это инопланетный формат. Пока что используйте видео или изображения.

source: Something wrong.
es: Algo salió mal.
ru: Что-то не так.

source: live portrait
es: retrato en vivo
ru: живого портрета

source: Don’t show tips on startup
es: No mostrar consejos al inicio
ru: Не показывать подсказки при запуске

source: Oopsie! Seems like you didn’t pick an object in your content. Click on the «Select object» button and choose any object from the media, please!
es: ¡Ups! Parece que no seleccionaste un objeto en tu contenido. Haz clic en el botón «Seleccionar objeto» y elige cualquier objeto de los medios, por favor.
ru: Упс! Похоже, вы не выбрали объект в вашем контенте. Нажмите на кнопку «Выбрать объект» и выберите любой объект из медиатеки.

source: Background color
es: Color de fondo
ru: Цвет фона

source: Reverse select
es: Invertir selección
ru: Инверсия области

source: Let the neural network handle it, then click to include with the right, exclude with the left. Don’t forget to switch brushes.
es: Deja que la red neuronal lo maneje, luego haz clic para incluir con la derecha, excluir con la izquierda. ¡No olvides cambiar los pinceles!
ru: Щелкните правой кнопкой для включения, левой для исключения области. Не забудьте переключить кисти.

source: Select object
es: Seleccionar objeto
ru: Выбрать объект

source: remove background
es: eliminar fondo
ru: удаления фона

source: remove object
es: eliminar objeto
ru: удаления объектов

source: Enable text indication to highlight selected areas while removing text instead of objects from your chosen field.
es: Habilita la indicación de texto para resaltar las áreas seleccionadas mientras eliminas texto en lugar de objetos de tu campo seleccionado.
ru: Включите индикатор текста, чтобы выделить выбранные области при удалении текста, а не объектов, из вашего выбранного поля.

source: Indicate text
es: Indicar texto
ru: Указать текст

source: Improved level
es: Nivel mejorado
ru: Продвинутый алгоритм

source: Text bothering you? Just draw a box around it. But the text outside the frame will remain. Easy as pie!
es: ¿El texto te molesta? Simplemente dibuja un cuadro alrededor de él. ¡Pero el texto fuera del cuadro permanecerá! ¡Tan fácil como un pastel!
ru: Текст мешает? Просто нарисуйте коробку вокруг него. Текст за пределами рамки останется. Просто как пирог!

source: Select text
es: Seleccionar texto
ru: Выбрать текст

source: Looks like you forgot to pick an object to restyle, or hey, why not go all out and change everything? Give it another shot!
es: ¡Parece que olvidaste seleccionar un objeto para cambiar de estilo, o mejor aún, por qué no cambiar todo! ¡Inténtalo de nuevo!
ru: Похоже, вы забыли выбрать объект для изменения стиля, или почему бы не изменить всё? Попробуйте ещё раз!

source: Uh-oh! This is strange magic, but the object is not selected. Try selecting objects again.
es: ¡Vaya! Esta es una magia extraña, pero el objeto no está seleccionado. Intenta seleccionar los objetos nuevamente.
ru: Ой! Это странная магия, но объект не выбран. Попробуйте выбрать объект снова.

source: Diffusion parameters is empty.
es: Los parámetros de difusión están vacíos.
ru: Параметры диффузии пусты.

source: Oops. Something wrong... Try another file.
es: ¡Ups! Algo salió mal... Intenta con otro archivo.
ru: Ой, что-то не так... Попробуйте другой файл.

source: Oops. Something wrong... Try another layer file.
es: ¡Ups! Algo salió mal... Intenta con otro archivo para agregar a la capa.
ru: Ой, что-то не так... Попробуйте другой файл для добавления в слой.

source: Activate the restyle background option to refresh the entire frame. This setting ensures that all elements are redrawn with the neural network, providing a seamless.
es: Activa la opción de cambiar el fondo para actualizar todo el cuadro. Esta configuración asegura que todos los elementos sean redibujados con la red neuronal, proporcionando una transición sin interrupciones.
ru: Активируйте опцию изменения фона, чтобы обновить весь кадр. Настройка гарантирует, что все элементы будут перерисованы нейросетью, обеспечивая плавность.

source: Restyle background
es: Cambiar fondo
ru: Изменить фон

source: Interval generation
es: Generación de intervalos
ru: Интервал генерации

source: Alright, listen up! The generation interval is like setting the tempo for your video’s style dance-off. Got a video with dynamic moves? Drop that value to crank up the tempo. It’s like your video’s heartbeat - more transitions mean a faster beat, so you’ll want a lower value. Nail that interval, and watch your video steal the spotlight in style!
es: ¡Bien, escuchen! El intervalo de generación es como establecer el tempo para el duelo de estilos de tu video. ¿Tienes un video con movimientos dinámicos? Baja ese valor para acelerar el tempo. Es como el latido de tu video: más transiciones significan un ritmo más rápido, así que querrás un valor más bajo. ¡Ajusta ese intervalo y mira cómo tu video roba el protagonismo con estilo!
ru: Итак, внимание! Интервал генерации — это как установка темпа для танцевального стиля вашего видео. Есть видео с динамичными движениями? Уменьшите это значение, чтобы увеличить темп. Это как пульс вашего видео — больше переходов означает более быстрый ритм, поэтому вам нужно выбрать более низкое значение. Подберите правильный интервал, и ваше видео станет потрясающим!

source: Threshold scene
es: Escena de umbral
ru: Погрешность перехода
