Repository: wladradchenko/wunjo.wladradchenko.ru
Catalog: portable/src/wunjo/translations/*/LC_MESSAGES/messages.po
Languages: es, ru

source: Heads up: This content is not a deepfake from Wunjo, but it could be a deepfake from another program or even original content. You know, I don’t know what I don’t know!
es: Atención: Este contenido no es un deepfake de Wunjo, pero podría ser un deepfake de otro programa o incluso contenido original. Ya sabes, no sé lo que no sé.
ru: Внимание: Этот контент не создан в Wunjo, но это может быть измененным (дипфейком) от другой программы или даже оригинальный контент. Знаете, я не знаю того, чего не знаю!

source: Yeah! This content appears to be a deepfake created by Wunjo.
es: ¡Sí! Este contenido parece ser un deepfake creado por Wunjo.
ru: Да! Этот контент измененный, созданным с помощью Wunjo.

source: Oops! An unexpected error occurred. Please try again.
es: ¡Vaya! Ocurrió un error inesperado. Por favor, inténtalo de nuevo.
ru: Упс! Произошла непредвиденная ошибка. Пожалуйста, попробуйте снова.

source: How many users are there?
es: ¿Cuántos usuarios hay?
ru: Сколько пользователей?

source: Pick your user squad! This sets how many tasks can strut their stuff simultaneously for everyone.
es: ¡Elige tu grupo de usuarios! Esto determina cuántas tareas pueden realizarse simultáneamente para todos.
ru: Выберите колличество пользователей! Определяет, сколько задач могут одновременно выполнять все пользователи.

source: What is resolution?
es: ¿Qué es la resolución?
ru: Какое разрешение?

source: Dial in the max length of your content’s long side. Bigger isn’t always better, but it sure does look good!
es: Ajusta la longitud máxima del lado más largo de tu contenido. ¡Lo más grande no siempre es mejor, pero seguro que se ve bien!
ru: Установите максимальную длину длинной стороны вашего контента. Большее не всегда лучше, но выглядит красиво!

source: Power usage?
es: ¿Uso de energía?
ru: Мощность?

source: Choose your RAM and VRAM power levels. Go big for multitasking magic or play it safe with minimal memory usage.
es: Elige los niveles de energía de tu RAM y VRAM. Ve a lo grande para magia de multitarea o juega seguro con un uso mínimo de memoria.
ru: Выберите уровни мощности для вашей оперативной и видеопамяти. Выберите больше для многозадачности или будьте осторожны с минимальным использованием памяти.

source: What is the duration? (in minutes)
es: ¿Cuál es la duración? (en minutos)
ru: Какова продолжительность? (в минутах)

source: What is the text length? (characters)
es: ¿Cuál es la longitud del texto? (en caracteres)
ru: Какова длина текста? (в символах)

source: Set the limit for your content duration. Anything longer gets the chop—no one likes an endless show!
es: Establece el límite para la duración de tu contenido. ¡Lo que sea más largo, se corta—nadie quiere un espectáculo interminable!
ru: Установите предел для продолжительности вашего контента. Все, что длиннее, будет обрезано — никто не любит бесконечное шоу!

source: Define the max character count for your text.
es: Define la cantidad máxima de caracteres para tu texto.
ru: Определите максимальное количество символов для вашего текста.

source: Transferring models may take some time. Do not close the software.
es: Transferir modelos puede tomar algo de tiempo. No cierres el software.
ru: Перемещение моделей может занять некоторое время. Не закрывайте программу.

source: Bring all!
es: ¡Trae todo!
ru: Много

source: A small group
es: Un pequeño grupo
ru: Немного

source: Just me!
es: ¡Solo yo!
ru: Один

source: Minimum
es: Mínimo
ru: Минимум

source: Medium
es: Medio
ru: Средний

source: Maximum
es: Máximo
ru: Максимум

source: An error occurred while checking the processor. Please try again later.
es: Ocurrió un error al verificar el procesador. Por favor, inténtalo de nuevo más tarde.
ru: Произошла ошибка при проверке процессора. Повторите попытку позже.

source: requires a GPU to function. If your system supports it, please switch from CPU to GPU in your settings.
es: requiere una GPU para funcionar. Si tu sistema lo admite, cambia de CPU a GPU en tu configuración.
ru: для работы требуется ГПУ. Если ваша система поддерживает его, переключитесь с ЦПУ на ГПУ в настройках.

source: What models are available?
es: ¿Qué modelos están disponibles?
ru: Какие модели доступны?

source: Which models can I access?
es: ¿A qué modelos tengo acceso?
ru: К каким моделям у меня есть доступ?

source: What options do I have in terms of models?
es: ¿Qué opciones tengo en cuanto a modelos?
ru: Какие варианты моделей у меня есть?

source: What kinds of models are at my disposal?
es: ¿Qué tipos de modelos tengo a mi disposición?
ru: Какие виды моделей у меня есть в распоряжении?

source: Which models are within my reach?
es: ¿Qué modelos están a mi alcance?
ru: Какие модели доступны мне?

source: What’s in the repertoire of available models?
es: ¿Qué hay en el repertorio de modelos disponibles?
ru: Какие модели входят в репертуар доступных?

source: What choices do I have among the models?
es: ¿Qué opciones tengo entre los modelos?
ru: Какие у меня есть варианты среди моделей?

source: Which models are up for grabs?
es: ¿Qué modelos están disponibles?
ru: Какие модели можно использовать?

source: What’s on the menu in terms of models?
es: ¿Qué modelos están en el menú?
ru: Какие модели представлены в меню?

source: What’s in the lineup of available models?
es: ¿Qué modelos están en la lista de disponibles?
ru: Какие модели входят в список доступных?

source: For manual model utilization
es: Para el uso manual del modelo
ru: Для ручного использования модели

source: In manually leveraging the model
es: Al aprovechar manualmente el modelo
ru: При ручном использовании модели

source: When employing the model manually
es: Cuando se utiliza el modelo manualmente
ru: При ручном применении модели

source: Utilizing the model manually involves
es: El uso manual del modelo implica
ru: Ручное использование модели включает

source: When integrating the model manually
es: Al integrar manualmente el modelo
ru: При ручной интеграции модели

source: In the manual application of the model
es: En la aplicación manual del modelo
ru: При ручном применении модели

source: For hands-on model utilization
es: Para el uso práctico del modelo
ru: Для практического использования модели

source: When using the model manually
es: Al usar el modelo manualmente
ru: При использовании модели вручную

source: In manual model integration
es: En la integración manual del modelo
ru: При ручной интеграции модели

source: For direct model application
es: Para la aplicación directa del modelo
ru: Для прямого применения модели

source: During manual model utilization
es: Durante el uso manual del modelo
ru: Во время ручного использования модели

source: Incorporating the model manually requires
es: Incorporar el modelo manualmente requiere
ru: Ручное включение модели требует

source: When applying the model manually
es: Al aplicar el modelo manualmente
ru: При ручном применении модели

source: Using the model manually necessitates
es: El uso manual del modelo requiere
ru: Ручное использование модели требует

source: In the hands-on utilization of the model
es: En el uso práctico del modelo
ru: При практическом использовании модели

source: For direct model utilization
es: Para el uso directo del modelo
ru: Для прямого использования модели

source: In manual model application
es: En la aplicación manual del modelo
ru: При ручном применении модели

source: During hands-on model integration
es: Durante la integración práctica del modelo
ru: Во время практической интеграции модели

source: Utilizing the model manually entails
es: El uso manual del modelo implica
ru: Ручное использование модели включает

source: You will able to find model in
es: Podrás encontrar el modelo en
ru: Вы сможете найти модель в

source: first
es: primero
ru: сначала

source: download the
es: descarga el
ru: скачайте

source: file. Once downloaded, extract its contents and place them in the following directory
es: archivo. Una vez descargado, extrae su contenido y colócalo en el siguiente directorio
ru: файл. После загрузки извлеките его содержимое и поместите в следующую директорию

source: file. Move it into the
es: archivo. Muévelo a
ru: файл. Переместите его в

source: renaming it as
es: renombrándolo como
ru: переименовав его в

source: Your system resources:
es: Tus recursos del sistema:
ru: Ваши системные ресурсы:

source: Total size of content
es: Tamaño total del contenido
ru: Общий размер контента

source: Total size of models
es: Tamaño total de los modelos
ru: Общий размер моделей

source: Total RAM
es: RAM total
ru: Объем оперативной памяти

source: Available RAM
es: RAM disponible
ru: Доступная оперативная память

source: Total VRAM
es: VRAM total
ru: Общий объем видеопамяти

source: Available VRAM
es: VRAM disponible
ru: Доступная видеопамять

source: in folder
es: en la carpeta
ru: в папке

source: In GPU mode
es: En modo GPU
ru: В режиме GPU

source: Currently, models from various
es: Actualmente, los modelos de varios
ru: В настоящее время модели из различных

source: On this machine, models are limited to CPU processing only. To utilize the GPU, please refer to the FAQ section or check the log for more information.
es: En esta máquina, los modelos están limitados solo al procesamiento en CPU. Para utilizar la GPU, consulte la sección de preguntas frecuentes o revise el registro para obtener más información.
ru: На этом компьютере модели ограничены только обработкой на CPU. Для использования GPU обратитесь к разделу FAQ или проверьте журнал для получения дополнительной информации.

source: models are executed using the GPU
es: los modelos se ejecutan utilizando la GPU
ru: модели выполняются с использованием GPU

source: modules are running on the CPU
es: los módulos se están ejecutando en la CPU
ru: модули работают на CPU

source: for enhanced performance. If you wish to give the machine a break, you can transfer the models back to the CPU by clicking
es: para un rendimiento mejorado. Si desea darle un descanso a la máquina, puede transferir los modelos de vuelta a la CPU haciendo clic en
ru: для повышения производительности. Если вы хотите дать машине отдых, вы можете вернуть модели на CPU, нажав

source: To switch to GPU processing, simply click
es: Para cambiar al procesamiento con GPU, simplemente haga clic en
ru: Чтобы переключиться на обработку с помощью GPU, просто нажмите

source: Remember, you can only switch processors when there is no active processing.
es: Recuerde, solo puede cambiar de procesador cuando no haya procesamiento activo.
ru: Помните, что вы можете переключаться между процессорами только при отсутствии активной обработки.

source: and please note that you can only transfer processing to the GPU if there is no ongoing computation.
es: y tenga en cuenta que solo puede transferir el procesamiento a la GPU si no hay cálculos en curso.
ru: и обратите внимание, что вы можете перенести обработку на GPU только при отсутствии текущих вычислений.

source: A new port has been installed. For the changes to take effect
es: Se ha instalado un nuevo puerto. Para que los cambios surtan efecto
ru: Установлен новый порт. Чтобы изменения вступили в силу

source: restart the application.
es: reinicie la aplicación.
ru: перезапустите приложение.

source: Your new port
es: Su nuevo puerto
ru: Ваш новый порт

source: But, if you need to switch port again. Just let click
es: Pero, si necesita cambiar de puerto nuevamente, simplemente haga clic en
ru: Но, если вам нужно снова переключить порт, просто нажмите

source: Application run on port
es: La aplicación se ejecuta en el puerto
ru: Приложение запущено на порту

source: You can get access to application by
es: Puede acceder a la aplicación a través de
ru: Вы можете получить доступ к приложению через

source: Your static port
es: Su puerto estático
ru: Ваш статический порт

source: which you can change in input.
es: que puede cambiar en la entrada.
ru: который вы можете изменить.

source: static port in local network.
es: puerto estático en la red local.
ru: статический порт в локальной сети.

source: If you need to apply switch port, I’ll handle it smoothly. Just let click
es: Si necesita cambiar de puerto, lo haré sin problemas. Simplemente haga clic en
ru: Если вам нужно переключить порт, я сделаю это без проблем. Просто нажмите

source: Your share link
es: Su enlace de compartición
ru: Ваша ссылка для совместного доступа

source: If you want to turn on share mode by
es: Si desea activar el modo de compartición a través de
ru: Если вы хотите включить режим совместного доступа через

source: public link, click
es: enlace público, haga clic en
ru: публичную ссылку, нажмите

source: If you wanna turn off share mode, click
es: Si desea desactivar el modo de compartición, haga clic en
ru: Если вы хотите отключить режим совместного доступа, нажмите

source: After updating the settings
es: Después de actualizar la configuración
ru: После обновления настроек

source: you need to restart
es: debe reiniciar
ru: вам нужно перезапустить

source: the application for the
es: la aplicación para que
ru: приложение, чтобы

source: changes to take effect.
es: los cambios surtan efecto.
ru: изменения вступили в силу.

source: Max CPU tasks running for all users at once
es: Máximo de tareas en CPU ejecutándose para todos los usuarios a la vez
ru: Максимальное количество задач на CPU для всех пользователей одновременно

source: Max module tasks running for all users at once
es: Máximo de tareas de módulos ejecutándose para todos los usuarios a la vez
ru: Максимальное количество задач модулей для всех пользователей одновременно

source: Max CPU tasks running for one user at once
es: Máximo de tareas en CPU ejecutándose para un usuario a la vez
ru: Максимальное количество задач на CPU для одного пользователя одновременно

source: Max module tasks running for one user at once
es: Máximo de tareas de módulos ejecutándose para un usuario a la vez
ru: Максимальное количество задач модулей для одного пользователя одновременно

source: Time to remove old CPU tasks (minutes)
es: Tiempo para eliminar tareas antiguas de CPU (minutos)
ru: Время для удаления старых задач на CPU (минуты)

source: Time to remove old module tasks (minutes)
es: Tiempo para eliminar tareas antiguas de módulos (minutos)
ru: Время для удаления старых задач модулей (минуты)

source: Delay between CPU tasks to calculate memory (seconds)
es: Retraso entre tareas de CPU para calcular la memoria (segundos)
ru: Задержка между задачами на CPU для расчета памяти (секунды)

source: Delay between module tasks to calculate memory (seconds)
es: Retraso entre tareas de módulos para calcular la memoria (segundos)
ru: Задержка между задачами модулей для расчета памяти (секунды)

source: Minimum RAM for CPU tasks (GB)
es: RAM mínima para tareas en CPU (GB)
ru: Минимальная оперативная память для задач на CPU (ГБ)

source: Minimum RAM for removing background (GB)
es: RAM mínima para eliminar el fondo (GB)
ru: Минимальная оперативная память для удаления фона (ГБ)

source: Minimum VRAM for removing background on GPU (GB)
es: VRAM mínima para eliminar el fondo en GPU (GB)
ru: Минимальная видеопамять для удаления фона на GPU (ГБ)

source: Minimum RAM for removing objects (GB)
es: RAM mínima para eliminar objetos (GB)
ru: Минимальная оперативная память для удаления объектов (ГБ)

source: Minimum VRAM for removing objects on GPU (GB)
es: VRAM mínima para eliminar objetos en GPU (GB)
ru: Минимальная видеопамять для удаления объектов на GPU (ГБ)

source: Minimum RAM for face swap tasks (GB)
es: Memoria RAM mínima para tareas de intercambio de rostros (GB)
ru: Минимальная оперативная память для задач смены лиц (ГБ)

source: Minimum VRAM for face swap tasks on GPU (GB)
es: Memoria VRAM mínima para tareas de intercambio de rostros en GPU (GB)
ru: Минимальная видеопамять для задач смены лиц на GPU (ГБ)

source: Minimum RAM for enhancement tasks (GB)
es: Memoria RAM mínima para tareas de mejora (GB)
ru: Минимальная оперативная память для задач улучшения (ГБ)

source: Minimum VRAM for enhancement tasks on GPU (GB)
es: Memoria VRAM mínima para tareas de mejora en GPU (GB)
ru: Минимальная видеопамять для задач улучшения на GPU (ГБ)

source: Minimum RAM for lip sync tasks (GB)
es: Memoria RAM mínima para tareas de sincronización labial (GB)
ru: Минимальная оперативная память для задач синхронизации губ (ГБ)

source: Minimum VRAM for lip sync tasks on GPU (GB)
es: Memoria VRAM mínima para tareas de sincronización labial en GPU (GB)
ru: Минимальная видеопамять для задач синхронизации губ на GPU (ГБ)

source: Minimum RAM for restyling on GPU (GB)
es: Memoria RAM mínima para tareas de cambio de estilo en GPU (GB)
ru: Минимальная оперативная память для задач изменения стиля на GPU (ГБ)

source: Minimum VRAM for restyling on GPU (GB)
es: Memoria VRAM mínima para tareas de cambio de estilo en GPU (GB)
ru: Минимальная видеопамять для задач изменения стиля на GPU (ГБ)

source: Minimum RAM for video generation on GPU (GB)
es: Memoria RAM mínima para generación de video en GPU (GB)
ru: Минимальная оперативная память для генерации видео на GPU (ГБ)

source: Minimum VRAM for video generation on GPU (GB)
es: Memoria VRAM mínima para generación de video en GPU (GB)
ru: Минимальная видеопамять для генерации видео на GPU (ГБ)

source: Minimum RAM for control restyling on GPU (GB)
es: Memoria RAM mínima para control de cambio de estilo en GPU (GB)
ru: Минимальная оперативная память для контроля изменения стиля на GPU (ГБ)

source: Minimum VRAM for control restyling on GPU (GB)
es: Memoria VRAM mínima para control de cambio de estilo en GPU (GB)
ru: Минимальная видеопамять для контроля изменения стиля на GPU (ГБ)

source: Minimum RAM for separator tasks (GB)
es: Memoria RAM mínima para tareas de separación (GB)
ru: Минимальная оперативная память для задач разделения (ГБ)

source: Minimum VRAM for separator tasks on GPU (GB)
es: Memoria VRAM mínima para tareas de separación en GPU (GB)
ru: Минимальная видеопамять для задач разделения на GPU (ГБ)

source: Minimum RAM for cloning voice (GB)
es: Memoria RAM mínima para tareas de clonación de voz (GB)
ru: Минимальная оперативная память для задач клонирования голоса (ГБ)

source: Minimum VRAM for cloning voice on GPU (GB)
es: Memoria VRAM mínima para tareas de clonación de voz en GPU (GB)
ru: Минимальная видеопамять для задач клонирования голоса на GPU (ГБ)

source: Minimum RAM for live portrait tasks (GB)
es: Memoria RAM mínima para tareas de retratos en vivo (GB)
ru: Минимальная оперативная память для задач с живыми портретами (ГБ)

source: Minimum VRAM for live portrait tasks on GPU (GB)
es: Memoria VRAM mínima para tareas de retratos en vivo en GPU (GB)
ru: Минимальная видеопамять для задач с живыми портретами на GPU (ГБ)

source: Max file size for upload (bytes)
es: Tamaño máximo de archivo para cargar (bytes)
ru: Максимальный размер файла для загрузки (байты)

source: Max resolution for removing background
es: Resolución máxima para eliminar el fondo
ru: Максимальное разрешение для удаления фона

source: Max resolution for removing objects
es: Resolución máxima para eliminar objetos
ru: Максимальное разрешение для удаления объектов

source: Max resolution for face swap
es: Resolución máxima para intercambio de rostros
ru: Максимальное разрешение для смены лиц

source: Max resolution for enhancement
es: Resolución máxima para mejora
ru: Максимальное разрешение для улучшения

source: Max resolution for lip sync
es: Resolución máxima para sincronización labial
ru: Максимальное разрешение для синхронизации губ

source: Max resolution for restyling
es: Resolución máxima para cambio de estilo
ru: Максимальное разрешение для изменения стиля

source: Max resolution for live portrait
es: Resolución máxima para retrato en vivo
ru: Максимальное разрешение для живого портрета

source: Max duration for background removal (seconds)
es: Duración máxima para eliminación de fondo (segundos)
ru: Максимальная продолжительность удаления фона (секунды)

source: Max duration for object removal (seconds)
es: Duración máxima para eliminación de objetos (segundos)
ru: Максимальная продолжительность удаления объектов (секунды)

source: Max duration for face swap (seconds)
es: Duración máxima para intercambio de rostros (segundos)
ru: Максимальная продолжительность смены лиц (секунды)

source: Max duration for enhancement (seconds)
es: Duración máxima para mejora (segundos)
ru: Максимальная продолжительность улучшения (секунды)

source: Max duration for lip sync (seconds)
es: Duración máxima para sincronización labial (segundos)
ru: Максимальная продолжительность синхронизации губ (секунды)

source: Max duration for restyling (seconds)
es: Duración máxima para cambio de estilo (segundos)
ru: Максимальная продолжительность изменения стиля (секунды)

source: Max duration for separator tasks (seconds)
es: Duración máxima para tareas de separación (segundos)
ru: Максимальная продолжительность задач разделения (секунды)

source: Max duration for cloning voice (seconds)
es: Duración máxima para clonación de voz (segundos)
ru: Максимальная продолжительность клонирования голоса (секунды)

source: Max duration for live portrait (seconds)
es: Duración máxima para retrato en vivo (segundos)
ru: Максимальная продолжительность живого портрета (секунды)

source: Max symbols for voice cloning
es: Número máximo de símbolos para clonación de voz
ru: Максимальное количество символов для клонирования голоса

source: Static port in local network
es: Puerto estático en la red local
ru: Статический порт в локальной сети

source: New value
es: Nuevo valor
ru: Новое значение

source: To apply the changes, click
es: Para aplicar los cambios, haga clic
ru: Чтобы применить изменения, нажмите

source: Remember that the changes will take effect after manually restarting the program.
es: Recuerde que los cambios tendrán efecto después de reiniciar el programa manualmente.
ru: Помните, что изменения вступят в силу после ручной перезагрузки программы.

source: The tour is currently disabled, but you can enable it by clicking
es: El recorrido está deshabilitado actualmente, pero puede habilitarlo haciendo clic en
ru: Подсказки по Wunjo в настоящее время отключен, но вы можете включить его, нажав

source: The tour is enabled to start automatically. To disable it, click
es: El recorrido está habilitado para comenzar automáticamente. Para deshabilitarlo, haga clic en
ru: Подсказки по Wunjo включен. Чтобы отключить его, нажмите

source: The translation tool is currently active and ready for use. Click
es: La herramienta de traducción está actualmente activa y lista para usarse. Haga clic en
ru: Инструмент перевода в настоящее время активен и готов к использованию. Нажмите

source: The translation tool is currently disabled. Click
es: La herramienta de traducción está actualmente deshabilitada. Haga clic en
ru: Инструмент перевода в настоящее время отключен. Нажмите

source: to disable it.
es: para deshabilitarla.
ru: чтобы отключить его.

source: enable it.
es: habilitarla.
ru: включить его.

source: Wow, that’s a large file! Please upload a file that’s less than
es: ¡Vaya, es un archivo muy grande! Por favor, sube un archivo de menos de
ru: Ого, это очень большой файл! Пожалуйста, загрузите файл размером меньше

source: bytes or change settings limit.
es: bytes o cambie el límite en la configuración.
ru: байт или измените предел в настройках.

source: Wow, that’s a lengthy video! Please upload a video that’s less than
es: ¡Vaya, es un video muy largo! Por favor, sube un video de menos de
ru: Ого, это очень длинное видео! Пожалуйста, загрузите видео длительностью меньше

source: seconds long or change settings limit.
es: segundos de duración o cambie el límite en la configuración.
ru: секунд или измените предел в настройках.
