Repository: wladradchenko/wunjo.wladradchenko.ru
Catalog: portable/src/wunjo/translations/*/LC_MESSAGES/messages.po
Languages: es, ru

source: Authorization
es: Autorización
ru: Авторизация

source: Obtain a token through a POST request using your email and password from wunjo.online. This token is available only to Wunjo Pro subscribers. Use the token for the
es: Obtén un token mediante una solicitud POST utilizando tu correo electrónico y contraseña de wunjo.online. Este token está disponible solo para suscriptores de Wunjo Pro. Usa el token para
ru: Получите токен через POST-запрос, используя вашу электронную почту и пароль с wunjo.online. Токен доступен только подписчикам Wunjo Pro. Используйте токен для

source: Submit module task
es: Enviar tarea del módulo
ru: Запуск длительной обработки

source: Submit CPU task
es: Enviar tarea de CPU
ru: Запуск быстрой обработки

source: File upload
es: Subida de archivos
ru: Загрузка файлов

source: Before using a module that requires a file, upload it via File upload and then use the file’s name. Files are uploaded to
es: Antes de usar un módulo que requiera un archivo, súbelo mediante Subida de archivos y luego usa el nombre del archivo. Los archivos se suben a
ru: Перед использованием модуля, который требует файл, загрузите его через загрузку файлов, а затем используйте имя файла. Файлы загружаются в

source: so ensure file names are unique. Test files like image.jpg, video.mp4, and audio.wav can be found at
es: asegúrate de que los nombres de los archivos sean únicos. Los archivos de prueba como image.jpg, video.mp4 y audio.wav se pueden encontrar en
ru: поэтому убедитесь, что имена файлов уникальны. Пример файлов, таких как image.jpg, video.mp4 и audio.wav, можно найти по следующей ссылке

source: Example requests are configured to work with these files for testing and customization.
es: Las solicitudes de ejemplo están configuradas para trabajar con estos archivos para pruebas y personalización.
ru: Пример запросов настроен для работы с этими файлами для тестирования и настройки.

source: Use the main modules in Wunjo via POST requests. Refer to Example for ready-to-use setups. Check Schema for detailed descriptions of each parameter, including accepted values and limits. Note that tasks are linked to your IP address. For localhost, it’s 127.0.0.1. On remote connections, tasks and files are IP-specific. You’ll receive a unique request_id for your task.
es: Usa los módulos principales de Wunjo a través de solicitudes POST. Consulta Example para configuraciones listas para usar. Revisa Schema para descripciones detalladas de cada parámetro, incluidos los valores aceptados y los límites. Ten en cuenta que las tareas están vinculadas a tu dirección IP. Para localhost, es 127.0.0.1. En conexiones remotas, las tareas y los archivos son específicos de la IP. Recibirás un request_id único para tu tarea.
ru: Используйте основные модули Wunjo через POST-запросы. Обратитесь к Example для готовых настроек. Проверьте Schema для подробных описаний каждого параметра, включая допустимые значения и ограничения. Обратите внимание, что задачи привязаны к вашему IP-адресу. Для localhost это 127.0.0.1. При удаленных подключениях задачи и файлы привязаны к вашему IP. Вы получите уникальный request_id для вашей задачи.

source: Track the status of your module task with a GET request by using the unique method name. The task status and response will be returned once with a 201 status, identifiable by the previously issued request_id. After retrieval, the task will be marked as not found. The response includes the media file path.
es: Rastrea el estado de tu tarea del módulo con una solicitud GET usando el nombre único del método. El estado de la tarea y la respuesta se devolverán una vez con un estado 201, identificable por el request_id emitido previamente. Después de la recuperación, la tarea se marcará como no encontrada. La respuesta incluye la ruta del archivo de medios.
ru: Отслеживайте статус задачи модуля с помощью GET-запроса, используя уникальное имя метода. Статус задачи и ответ вернутся один раз с кодом 201, который можно идентифицировать по ранее выданному request_id. После получения задача будет помечена как не найденная. Ответ включает путь к файлу.

source: Similar to /submit-module-task, this POST request provides a request_id. More details on parameters can be found in Schema.
es: Similar a /submit-module-task, esta solicitud POST proporciona un request_id. Más detalles sobre los parámetros se pueden encontrar en Schema.
ru: Похожий на /submit-module-task, этот POST-запрос предоставляет request_id. Дополнительные детали параметров можно найти в Schema.

source: Check task readiness with a GET request using the request_id. The task response is returned once with a 201 status, and then the task is marked as not found. The response includes the media file path or data.
es: Verifica la preparación de la tarea con una solicitud GET usando el request_id. La respuesta de la tarea se devuelve una vez con un estado 201, luego la tarea se marcará como no encontrada. La respuesta incluye la ruta del archivo de medios o los datos.
ru: Проверьте готовность задачи с помощью GET-запроса, используя request_id. Ответ на задачу вернется один раз с кодом 201, затем задача будет помечена как не найденная. Ответ включает путь к файлу или данные.

source: Use a GET request to view processing progress, steps completed, error statuses, and success messages. All data is logged. For further questions, contact support@wunjo.online or join on
es: Usa una solicitud GET para ver el progreso del procesamiento, los pasos completados, los estados de error y los mensajes de éxito. Todos los datos se registran. Para más preguntas, contacta a support@wunjo.online o únete en
ru: Используйте GET-запрос, чтобы увидеть процесс обработки, выполненные шаги, статусы ошибок и сообщения об успехе. Все данные логируются. По дополнительным вопросам обращайтесь на support@wunjo.online или присоединяйтесь к обсуждению на

source: Console log
es: Registro de consola
ru: Журнал консоли

source: Query CPU task
es: Consultar tarea de CPU
ru: Запрос задачи CPU

source: Query module task
es: Consultar tarea del módulo
ru: Запрос задачи модуля

source: Remember about settings! To work with API, place files in the
es: ¡Recuerda las configuraciones! Para trabajar con la API, coloca los archivos en la
ru: Помните о настройках! Для работы с API поместите файлы в

source: tmp folder
es: carpeta tmp
ru: tmp директорию

source: of the cache directory.
es: del directorio de caché.
ru: каталога кэша.

source: Processing
es: Procesando
ru: Обрабатывается

source: Check Warning
es: Ver advertencia
ru: Проверить лог

source: View Error
es: Ver error
ru: Открыть ошибку

source: Ready to manually retargeting face? Feel like a real puppeteer. Let’s go!
es: ¿Listo para cambiar manualmente la cara? Siéntete como un verdadero titiritero. ¡Vamos!
ru: Готовы вручную изменить лицо? Почувствуйте себя настоящим кукловодом. Поехали!

source: video
ru: видео

source: image
es: imagen
ru: изображение

source: text
es: texto
ru: текст

source: Bring your portraits to life<br> with update a spark of emotion to any
es: Da vida a tus retratos<br> actualiza una chispa de emoción a cualquier
ru: Оживите свои портреты<br> добавьте искру эмоций к любому

source: content
es: contenido
ru: контенту

source: Learn how to seamlessly perform<br> a face swap using just one photo
es: Aprende a realizar sin problemas<br> un cambio de cara usando solo una foto
ru: Узнайте, как легко сделать<br> замену лица с помощью одной фотографии

source: Learn how to seamlessly <br> animate mouth movements using audio
es: Aprende a animar sin problemas <br> los movimientos de la boca usando audio
ru: Узнайте, как легко <br> анимировать движения рта с помощью аудио

source: Update
es: Actualizar
ru: Обновить

source: and even give faces a digital makeover.
es: y incluso darle a las caras un cambio digital.
ru: и даже убрать морщины для лица.

source: low-res content
es: contenido de baja resolución
ru: контент с низким разрешением

source: secrets
es: aquí
ru: здесь

source: Unlock <br> object removal
es: Desbloquea <br> la eliminación de objetos
ru: Откройте <br> удаление объектов

source: and <br> get chroma key.
es: fondo y <br> obtener la clave cromática.
ru: фона и <br> получения хромакея.

source: removal
es: eliminación
ru: удаление

source: Master background
es: Domina el fondo
ru: Освойте

source: from text or images. <br>No more effort for beautiful content.
es: de texto o imágenes. <br>Sin más esfuerzo para un contenido hermoso.
ru: из текста или изображений. <br>Больше никакой суеты для красивого контента.

source: video life
es: aquí
ru: здесь

source: Bring your content to
es: Haz que tu contenido cobre vida
ru: Оживите ваш контент

source: Discover how to change full <br> content or object inside by text prompts in
es: Descubre cómo cambiar todo el <br> contenido o el objeto dentro mediante comandos de texto en
ru: Узнайте, как изменить весь <br> контент или объект внутри с помощью текстовых запросов

source: Learn how to seamlessly perform<br> clone voice of your neighbors in
es: Aprende cómo realizar sin esfuerzo<br> la clonación de voz de tus vecinos en
ru: Узнайте, как легко<br> клонировать голос для обучающих роликов

source: Separate
es: Separa
ru: Разделите

source: vocals from background <br> music effortlessly.
es: la voz de la música de fondo <br> sin esfuerzo.
ru: вокал от фоновой <br> музыки без усилий.

source: Manipulate and animate faces with ease. Move the head, add emotions, or create blinks — manually or automatically. Ideal for bringing static photos to life!
es: Manipula y anima las caras con facilidad. Mueve la cabeza, añade emociones o crea parpadeos, ya sea manualmente o automáticamente. ¡Ideal para dar vida a fotos estáticas!
ru: Манипулируйте и анимируйте лица с легкостью. Двигайте голову, добавляйте эмоции или создавайте моргания — вручную или автоматически. Идеально для оживления статических фотографий!

source: Enhance facial details to correct imperfections and achieve a polished look.
es: Mejora los detalles faciales para corregir imperfecciones y lograr un aspecto pulido.
ru: Улучшите детали лица для исправления недостатков и достижения безупречного внешнего вида.

source: Replace faces in specific time intervals with precision. If inconsistencies appear, try replacing all faces for improved quality.
es: Reemplaza las caras en intervalos de tiempo específicos con precisión. Si aparecen inconsistencias, prueba reemplazar todas las caras para mejorar la calidad.
ru: Заменяйте лица в определенные временные интервалы с точностью. Если появляются несоответствия, попробуйте заменить все лица для улучшения качества.

source: Add realism to swapped faces by reintroducing natural blinks manually.
es: Añade realismo a las caras intercambiadas reintroduciendo parpadeos naturales manualmente.
ru: Добавьте реализм замененным лицам, вручную добавив естественные моргания.

source: Improve the quality of the swapped face for a seamless result. Experiment by alternating between Enhancement and Live Portrait for better outcomes.
es: Mejora la calidad de la cara intercambiada para obtener un resultado sin costuras. Experimenta alternando entre Mejora y Retrato Vivo para obtener mejores resultados.
ru: Улучшите качество замененного лица для получения бесшовного результата. Экспериментируйте, чередуя улучшение качества и живой портрет для достижения лучших результатов.

source: For better video, use the «silence» mode in manually retargeting live portrait to pre-process the mouth to a closed state before applying lip sync.
es: Para obtener mejor video, utiliza el modo «silencio» al redirigir manualmente el retrato vivo para preprocesar la boca hasta un estado cerrado antes de aplicar la sincronización labial.
ru: Для лучшего видео используйте режим «тишина» при ручном перенаправлении живого портрета, чтобы предварительно обработать рот до закрытого состояния перед применением синхронизации губ.

source: Animate lips in photos and videos with realistic movements. Remove double chins if needed for a refined look (note: this may take extra time).
es: Anima los labios en fotos y videos con movimientos realistas. Elimina los doble mentón si es necesario para un aspecto más refinado (nota: esto puede tomar tiempo adicional).
ru: Анимируйте губы на фотографиях и видео с реалистичными движениями. Удаляйте двойной подбородок при необходимости для более утонченного вида (примечание: это может занять дополнительное время).

source: Further enhance the face’s quality for sharper and clearer animations.
es: Mejora aún más la calidad de la cara para animaciones más nítidas y claras.
ru: Дальнейшее улучшение качества лица для более четких и ясных анимаций.

source: Refine face or content quality, eliminating blurry areas for a sharper overall result.
es: Refina la calidad de la cara o el contenido, eliminando áreas borrosas para un resultado más nítido en general.
ru: Улучшите качество лица или контента, устранив размытые области для более четкого общего результата.

source: Remove unwanted text or objects from videos effortlessly. Even moving objects can be removed automatically by the neural network.
es: Elimina texto u objetos no deseados de los videos sin esfuerzo. Incluso los objetos en movimiento pueden ser eliminados automáticamente por la red neuronal.
ru: Удаляйте нежелательный текст или объекты из видео без усилий. Даже движущиеся объекты могут быть автоматически удалены нейронной сетью.

source: Restore resolution and improve content quality if it diminishes after object removal.
es: Restaura la resolución y mejora la calidad del contenido si disminuye después de la eliminación de objetos.
ru: Восстановите разрешение и улучшите качество контента, если оно уменьшилось после удаления объектов.

source: Remove the background from photos or videos. Photos can have transparent backgrounds, while videos will use chromakey.
es: Elimina el fondo de fotos o videos. Las fotos pueden tener fondos transparentes, mientras que los videos usarán la clave cromática.
ru: Удаляйте фон с фотографий или видео. Фотографии могут иметь прозрачный фон, а видео будут использовать хромакей.

source: Generate videos from text (any language) and images. Control content with brushes and prompts. Create images from text, customize details, and bring your imagination to life.
es: Genera videos a partir de texto (cualquier idioma) e imágenes. Controla el contenido con pinceles y comandos. Crea imágenes a partir de texto, personaliza detalles y da vida a tu imaginación.
ru: Создавайте видео из текста (любой язык) и изображений. Управляйте контентом с помощью кистей и подсказок. Создавайте изображения из текста, настраивайте детали и воплощайте свои идеи в жизнь.

source: Transform using text (any language) your videos or photos into unique styles. For example, dancing in the ocean or sipping coffee in space. Control manually or auto elements such as skin tones.
es: Transforma tus videos o fotos usando texto (cualquier idioma) en estilos únicos. Por ejemplo, bailar en el océano o tomar café en el espacio. Controla manualmente o automáticamente elementos como los tonos de piel.
ru: Превращайте ваши видео или фотографии с помощью текста (любой язык) в уникальные стили. Например, танец в океане или кофе в космосе. Управляйте вручную или автоматически элементами, такими как тон кожи.

source: If limited video memory causes low resolution, enhance content quality and upscale it effortlessly.
es: Si la memoria de video limitada causa baja resolución, mejora la calidad del contenido y amplíalo sin esfuerzo.
ru: Если ограниченная видеопамять вызывает низкое разрешение, улучшите качество контента и увеличьте его масштаб без усилий.

source: Clone speech from text. Choose a text generation (before this select language) or convert your voice to match a cloned tone.
es: Clona el habla a partir de texto. Elige una generación de texto (antes selecciona el idioma) o convierte tu voz para que coincida con un tono clonado.
ru: Клонируйте речь из текста. Выберите генерацию текста (перед этим выберите язык) или преобразуйте ваш голос, чтобы он соответствовал клонированному тону.

source: Separate vocals and instrumentals from music with just one click.
es: Separa la voz y los instrumentos de la música con un solo clic.
ru: Разделите вокал и инструменталы в музыке одним кликом.

source: Customize object colors or experiment with unique styles — turn your face into an alien, for example, with text-driven (any language) transformations.
es: Personaliza los colores de los objetos o experimenta con estilos únicos: convierte tu cara en un extraterrestre, por ejemplo, con transformaciones impulsadas por texto (cualquier idioma).
ru: Настраивайте цвета объектов или экспериментируйте с уникальными стилями — превратите свое лицо в инопланетянина, например, с текстовыми (любой язык) трансформациями.

source: Replace deformed or inconsistent faces in frames. Use the first frame of your video to maintain consistent facial features.
es: Reemplaza caras deformadas o inconsistentes en los fotogramas. Usa el primer fotograma de tu video para mantener características faciales consistentes.
ru: Заменяйте деформированные или несогласованные лица в кадрах. Используйте первый кадр вашего видео, чтобы сохранить согласованность черт лица.

source: Finalize your project by improving the face or overall content quality.
es: Finaliza tu proyecto mejorando la calidad de la cara o del contenido en general.
ru: Завершите ваш проект, улучшив качество лица или общего контента.

source: Isolate vocals and instrumentals from a song. This will prepare them for editing and further transformations.
es: Aísla las voces y los instrumentos de una canción. Esto los preparará para su edición y transformaciones posteriores.
ru: Изолируйте вокал и инструменталы из песни. Это подготовит их к редактированию и дальнейшим трансформациям.

source: Record a new vocal segment and clone its sound to match the original song. Then reassemble the vocals and instrumentals for a seamless edit.
es: Graba un nuevo segmento vocal y clona su sonido para que coincida con la canción original. Luego vuelve a ensamblar las voces y los instrumentos para una edición perfecta.
ru: Запишите новый вокальный сегмент и клонируйте его звук, чтобы он соответствовал оригинальной песне. Затем соберите вокал и инструменталы для бесшовного редактирования.

source: Need a speaking character in your video? Start by finding a similar face or generating one via avatar creation. Perfect for when you lack real footage.
es: ¿Necesitas un personaje que hable en tu video? Comienza encontrando un rostro similar o generando uno mediante la creación de un avatar. Perfecto cuando te falta material real.
ru: Нужен говорящий персонаж в вашем видео? Начните с поиска похожего лица или создания его через генерацию аватара. Идеально, когда не хватает реальных кадров.

source: Add voice to the video by cloning from a preferred voice tone. Write the script, choose a language, and let the neural network handle the rest.
es: Agrega voz al video clonando desde un tono de voz preferido. Escribe el guion, elige un idioma y deja que la red neuronal haga el resto.
ru: Добавьте голос к видео, клонировав из предпочитаемого тона голоса. Напишите сценарий, выберите язык, и пусть нейронная сеть сделает остальное.

source: Synchronize lips with the generated voiceover for added realism. Enhance the face quality for a polished result.
es: Sincroniza los labios con la voz generada para agregar realismo. Mejora la calidad de la cara para un resultado impecable.
ru: Синхронизируйте губы с сгенерированной озвучкой для добавления реализма. Улучшите качество лица для безупречного результата.

source: Manipulate the head, add emotions, or create blinks — manually or automatically.
es: Manipula la cabeza, agrega emociones o crea parpadeos, manualmente o automáticamente.
ru: Манипулируйте головой, добавляйте эмоции или создавайте моргания — вручную или автоматически.

source: If you need to analyze photos, videos and determine whether the content is artificially created in Wunjo, you can do this using analysis.
es: Si necesitas analizar fotos, videos y determinar si el contenido fue creado artificialmente en Wunjo, puedes hacerlo utilizando el análisis.
ru: Если вам необходимо проанализировать фотографии, видео и определить, является ли контент искусственно созданным в Wunjo, вы можете сделать это с помощью анализа.

source: If you need to analyze audio and determine whether the content is artificially created in Wunjo, you can do this using analysis.
es: Si necesitas analizar audio y determinar si el contenido fue creado artificialmente en Wunjo, puedes hacerlo utilizando el análisis.
ru: Если вам необходимо проанализировать аудио и определить, является ли контент искусственно созданным в Wunjo, вы можете сделать это с помощью анализа.

source: Translator
es: Traductor
ru: Переводчик

source: Hello, welcome to the tour
es: Hola, bienvenido al recorrido
ru: Добро пожаловать на экскурсию

source: In begin, we’ll take a look at the translator. If you come across any text that’s not clear, you can easily translate it into your language. Just select the text, and it will appear in the translator. To open it, click on the element. You can also move the translator to any convenient place on your screen by
es: Al principio, echaremos un vistazo al traductor. Si te encuentras con algún texto que no entiendas, puedes traducirlo fácilmente a tu idioma. Simplemente selecciona el texto y aparecerá en el traductor. Para abrirlo, haz clic en el elemento. También puedes mover el traductor a cualquier lugar conveniente en tu pantalla arrastrándolo.
ru: Сначала мы рассмотрим переводчик. Если вы столкнулись с текстом, который непонятен, вы можете легко перевести его на свой язык. Просто выделите текст, и он появится в переводчике. Чтобы открыть его, нажмите на элемент. Вы также можете переместить переводчик в любое удобное место на экране, перетащив его.

source: (dragging it).
es: (arrastrándolo).
ru: (перетаскивая его).

source: Try it: After click
es: Pruébalo: Después de hacer clic
ru: Попробуйте: после клика

source: next
es: siguiente
ru: далее

source: , open the translator, and select the text you want to translate.
es: , abre el traductor y selecciona el texto que deseas traducir.
ru: , откройте переводчик и выберите текст, который хотите перевести.

source: You can
es: Puedes
ru: Вы можете

source: disable
es: desactivar
ru: отключить

source: the translator display or change your preferences in the settings.
es: la visualización del traductor o cambiar tus preferencias en la configuración.
ru: отображение переводчика или изменить ваши предпочтения в настройках.

source: January
es: Enero
ru: Январь

source: February
es: Febrero
ru: Февраль

source: March
es: Marzo
ru: Март

source: April
es: Abril
ru: Апрель

source: May
es: Mayo
ru: Май

source: June
es: Junio
ru: Июнь

source: July
es: Julio
ru: Июль

source: August
es: Agosto
ru: Август

source: September
es: Septiembre
ru: Сентябрь

source: October
es: Octubre
ru: Октябрь

source: November
es: Noviembre
ru: Ноябрь

source: December
es: Diciembre
ru: Декабрь

source: Jan
es: Ene
ru: Янв

source: Feb
ru: Фев

source: Mar
ru: Мар

source: Apr
es: Abr
ru: Апр

source: Jun
ru: Июн

source: Jul
ru: Июл

source: Aug
es: Ago
ru: Авг

source: Sep
ru: Сен

source: Oct
ru: Окт

source: Nov
ru: Ноя

source: Dec
es: Dic
ru: Дек

source: Oops! Something went wrong. Please try again.
es: ¡Ups! Algo salió mal. Por favor, inténtalo de nuevo.
ru: Упс! Что-то пошло не так. Пожалуйста, попробуйте снова.
