Repository: wladradchenko/wunjo.wladradchenko.ru
Catalog: portable/src/wunjo/translations/*/LC_MESSAGES/messages.po
Languages: es, ru

source: Make sure Wunjo has the necessary permissions for installation. If needed, try running it as
es: Asegúrate de que Wunjo tenga los permisos necesarios para la instalación. Si es necesario, intenta ejecutarlo como
ru: Убедитесь, что у Wunjo есть необходимые разрешения для установки. При необходимости попробуйте запустить программу от имени

source: Administrator
es: Administrador
ru: Администратора

source: Great. You need to restart Wunjo
es: Genial. Necesitas reiniciar Wunjo
ru: Отлично. Перезапустите Wunjo.

source: Before you proceed, manually remove any previous versions of torch, torchaudio, and torchvision. First, close Wunjo software, delete those folders from
es: Antes de continuar, elimina manualmente cualquier versión anterior de torch, torchaudio y torchvision. Primero, cierra el software Wunjo, elimina esas carpetas de
ru: Прежде чем продолжить, вручную удалите все предыдущие версии torch, torchaudio и torchvision. Сначала закройте программное обеспечение Wunjo, удалите эти папки из

source: software directory
es: directorio del software
ru: каталога программного обеспечения

source: and then run Wunjo with admin root privileges.
es: y luego ejecuta Wunjo con privilegios de administrador.
ru: и затем запустите Wunjo с правами администратора.

source: Close
es: Cerrar
ru: Закрыть

source: Error. Not found permission
es: Error. No se encontró permiso
ru: Ошибка. Не найдено разрешение

source: Error fetching. Try again
es: Error de descarga. Intenta nuevamente
ru: Ошибка загрузки. Попробуйте еще раз

source: Before you need to install
es: Antes de eso, debes instalar
ru: Прежде установите

source: from official website.
es: desde el sitio web oficial.
ru: с официального сайта.

source: User ID
es: ID de usuario
ru: ID

source: Public link
es: Enlace público
ru: Публичная ссылка

source: Password
es: Contraseña
ru: Пароль

source: Your password from wunjo.online
es: Tu contraseña de wunjo.online
ru: Ваш пароль от wunjo.online

source: Email
es: Correo electrónico
ru: Почта

source: Sign in
es: Iniciar sesión
ru: Войти

source: Sign out
es: Cerrar sesión
ru: Выйти

source: Exit
es: Salir
ru: Закрыть

source: Subscription
es: Suscripción
ru: Подписка

source: Plan
ru: План

source: Free
es: Gratis
ru: Бесплатно

source: Upgrade
es: Mejorar
ru: Улучшить

source: Unleash the Speed
es: Desata la velocidad
ru: Полная скорость

source: Upgrade to the GPU-Powered Version for Blazing Speed and Unmatched Power
es: Actualiza a la versión con soporte para GPU para obtener una velocidad fulgurante y potencia incomparable
ru: Обновитесь до полной версии, чтобы получить молниеносную скорость и непревзойденную мощность

source: Upgrade to Professional
es: Actualiza a Professional
ru: Обновление до Professional

source: Public links provide access to the program from mobile devices and tablets
es: Los enlaces públicos proporcionan acceso al programa desde dispositivos móviles y tabletas
ru: Публичные ссылки обеспечивают доступ к программе с мобильных устройств и планшетов

source: Activated
es: Activado
ru: Активировано

source: Expiration date
es: Fecha de expiración
ru: Дата окончания подписки

source: Unleashed the Speed
es: Velocidad desatada
ru: Полная скорость

source: No restrictions on features until
es: Sin restricciones en las funciones hasta
ru: Никаких ограничений на функции до

source: Drag and drop a file or select one. You can upload either a video or an image. For instructions on how to use the Remove Background module, check out this
es: Arrastra y suelta un archivo o selecciona uno. Puedes cargar un video o una imagen. Para instrucciones sobre cómo usar el módulo de eliminación de fondo, consulta este
ru: Перетащите файл или выберите его. Вы можете загрузить видео или изображение. Для инструкций по использованию модуля удаление фона посмотрите этот

source: So, you’ve nixed an object from your content, nice move! But hey, sometimes where one thing leaves, a little confusion might creep in because of the neural network does not know what could be in the place of a distant object, it just invents it. Noticed some weird glares or streaks in the now-empty spot? That’s where a video enhancement feature swoops in to save the day. Take your pick: transform your video into an anime-style gem, a classic cartoon, or simply give it a polished boost. The module’s right
es: ¡Así que has eliminado un objeto de tu contenido, buen movimiento! Pero a veces, cuando algo desaparece, puede aparecer algo de confusión porque la red neuronal no sabe qué podría haber en el lugar de un objeto distante, solo lo inventa. ¿Notaste algunos reflejos extraños o rayas en el lugar ahora vacío? Ahí es donde una función de mejora de video entra en acción para salvar el día. Elige lo que prefieras: transforma tu video en una joya de estilo anime, un dibujo animado clásico o simplemente dale un toque pulido.
ru: Итак, вы удалили объект из вашего контента, отличный ход! Но иногда, когда что-то исчезает, может появиться небольшая путаница, потому что нейронная сеть не знает, что может находиться на месте удаленного объекта, она просто придумывает это. Заметили странные блики или полосы? Вот где функция улучшения качества приходит на помощь. Выберите свой вариант: превратите видео в аниме-шедевр, классический мультфильм или просто добавьте ему лоск.

source: , waiting to sprinkle its magic on your creation.
es: , esperando esparcir su magia sobre tu creación.
ru: , готовьтесь сотворить волшебство с вашим творением.

source: Drag and drop a file or select one. You can upload either a video or an image. For instructions on how to use the Remove Object module, check out this
es: Arrastra y suelta un archivo o selecciona uno. Puedes cargar un video o una imagen. Para instrucciones sobre cómo usar el módulo de eliminación de objetos, consulta este
ru: Перетащите файл или выберите его. Вы можете загрузить видео или изображение. Для инструкций по использованию модуля удаления объектов посмотрите этот

source: All red blocks should turn green, use toggle if you need to remove text, and then press on the button
es: Todos los bloques rojos deben volverse verdes, usa el interruptor si necesitas eliminar el texto, y luego presiona el botón
ru: Все красные блоки должны стать зелеными, используйте переключатель, если нужно удалить текст, а затем нажмите на кнопку

source: CUSTOMIZING PROMPTS
es: Personalización de solicitudes
ru: Модификация запроса

source: Inpainting... Buttons are locked until finished. Tap on the screen to view details.
es: Inpainting... Los botones están bloqueados hasta que se termine. Toca en la pantalla para ver detalles.
ru: Inpainting... Кнопки заблокированы до завершения. Нажмите на экран, чтобы просмотреть подробности.

source: Prepare your staff. Select an object and scene, set parameters and properties, and change it by prompt. When you are satisfied with the result, move on to the next frame.
es: Prepara tu personal. Selecciona un objeto y una escena, ajusta los parámetros y propiedades, y cámbialo según la solicitud. Cuando estés satisfecho con el resultado, pasa al siguiente cuadro.
ru: Выберите объект и сцену, задайте параметры и свойства и измените их по подсказке. Когда вы будете удовлетворены результатом, переходите к следующему кадру.

source: Drag and drop a file or select one. You can upload either a video or an image. For instructions on how to use the Restyling module, check out this
es: Arrastra y suelta un archivo o selecciona uno. Puedes cargar un video o una imagen. Para instrucciones sobre cómo usar el módulo de restyling, consulta este
ru: Перетащите файл или выберите его. Вы можете загрузить видео или изображение. Для инструкций по использованию модуля рестайлинг контента посмотрите этот

source: All red blocks should turn green or use toggle to fully restyle, and then press the
es: Todos los bloques rojos deben volverse verdes o usa el interruptor para realizar un restyling completo, y luego presiona el botón
ru: Все красные блоки должны стать зелеными или используйте переключатель для полного рестайлинга, а затем нажмите на кнопку

source: Drag and drop a file or select one. You can upload an audio. For instructions on how to use the Separator module, check out this
es: Arrastra y suelta un archivo o selecciona uno. Puedes cargar un archivo de audio. Para obtener instrucciones sobre cómo usar el módulo Separador, consulta este
ru: Перетащите файл или выберите его. Вы можете загрузить аудиофайл. Для инструкций по использованию модуля аудио разделитель посмотрите этот

source: Upload an audio, and then press the
es: Carga un archivo de audio, y luego presiona el botón
ru: Загрузите аудиофайл, а затем нажмите на кнопку

source: General
ru: Общие

source: Which processor should I use?
es: ¿Qué procesador debo usar?
ru: Какой процессор мне следует использовать?

source: Can I change cache folder?
es: ¿Puedo cambiar la carpeta de caché?
ru: Можно ли изменить папку кэша?

source: Yes! You can change the location of the cache, including placing it in the
es: ¡Sí! Puedes cambiar la ubicación de la caché, incluyendo colocarla en
ru: Да! Вы можете изменить местоположение кэша, в том числе поместить его в

source: or on another drive. However, please ensure that the new folder has the necessary permissions for processing and you have permissions to use folder. Just
es: o en otro disco. Sin embargo, asegúrate de que la nueva carpeta tenga los permisos necesarios para el procesamiento y tengas permisos para usar la carpeta. Solo
ru: или на другом диске. Однако, пожалуйста, убедитесь, что новая папка имеет необходимые разрешения для обработки и у вас есть разрешения на использование папки. Просто

source: click here
es: haz clic aquí
ru: нажмите здесь

source: What is port using?
es: ¿Qué puerto se está usando?
ru: Какой порт?

source: Can I get public link?
es: ¿Puedo obtener un enlace público?
ru: Могу ли я получить публичную ссылку?

source: Want to go through the software tour once more?
es: ¿Quieres repasar el recorrido del software una vez más?
ru: Хотите еще раз узнать больше про программное обеспечение?

source: Show translation tool?
es: ¿Mostrar la herramienta de traducción?
ru: Показать инструмент перевода?

source: What system resources?
es: ¿Qué recursos del sistema?
ru: Какие системные ресурсы?

source: Update application parameters?
es: ¿Actualizar los parámetros de la aplicación?
ru: Обновить параметры приложения?

source: Hold up
es: Espera un momento
ru: Минута внимания

source: What happens
es: ¿Qué sucede?
ru: Что происходит

source: Click to see
es: Haz clic para ver
ru: Посмотреть

source: Grab the Log
es: Descargar el registro
ru: Скачать лог

source: Are you absolutely sure you want to delete
es: ¿Estás absolutamente seguro de que deseas eliminar
ru: Вы абсолютно уверены, что хотите удалить

source: Once it’s gone, it’s gone!
es: ¡Una vez que se vaya, se irá!
ru: Как только оно исчезнет, оно исчезнет!

source: Sure
es: Sí
ru: Да

source: Are you ready to replace
es: ¿Estás listo para reemplazar?
ru: Вы готовы заменить

source: Remember, this action cannot be undone! Only if you don’t rename it again.
es: Recuerda, ¡esta acción no se puede deshacer! Solo si no lo renombras de nuevo.
ru: Помните, это действие нельзя отменить! Только если вы не переименуете его снова.

source: Let’s Do It!
es: ¡Hagámoslo!
ru: Да

source: Display content
es: Mostrar contenido
ru: Отображение содержимого

source: Image output
es: Salida de imagen
ru: Изображение

source: Edit
es: Editar
ru: Редактор

source: Without description
es: Sin descripción
ru: Без описания

source: Parameters
es: Parámetros
ru: Параметры

source: Consistency with the text
es: Consistencia con el texto
ru: Соответствие

source: Download All
es: Descargar todo
ru: Скачать

source: Previous
es: Anterior
ru: Назад

source: Delete All
es: Eliminar todo
ru: Удалить

source: Next
es: Siguiente
ru: Дальше

source: Video output
es: Salida de video
ru: Видео

source: FPS
ru: ФПС

source: Yesterday
es: Ayer
ru: Вчера

source: Sun
es: Dom
ru: Вс

source: Mon
es: Lun
ru: Пн

source: Tue
es: Mar
ru: Вт

source: Wed
es: Mié
ru: Ср

source: Thu
es: Jue
ru: Чт

source: Fri
es: Vie
ru: Пт

source: Sat
es: Sáb
ru: Сб

source: Oh, ya!
ru: Да

source: Just a second
es: Un momento
ru: Секундочку

source: Please wait while the model is loading into your browser’s memory
es: Por favor, espere mientras el modelo se carga en la memoria de su navegador
ru: Пожалуйста, подождите, пока модель загрузится в память вашего браузера

source: CLICK ON OBJECT
es: HAGA CLIC EN EL OBJETO
ru: НАЖМИТЕ НА ОБЪЕКТ

source: Brush
es: Pincel
ru: Кисти

source: Clear
es: Borrar
ru: Очистить

source: Embedding... Right-click to select objects, left-click to exclude. Tap the screen to view details.
es: Incrustando... Haga clic derecho para seleccionar objetos, clic izquierdo para excluir. Toque la pantalla para ver detalles.
ru: Embedding... Щелкните правой кнопкой мыши, чтобы выбрать объекты, левой — чтобы исключить. Коснитесь экрана, чтобы просмотреть подробности.

source: Watch
es: Ver
ru: Просмотр

source: Video input
es: Entrada de video
ru: Видео

source: Not accessible.
es: No accesible.
ru: Заблокировано.

source: Unlock controls by click on watch button.
es: Desbloquee los controles haciendo clic en el botón de ver.
ru: Разблокируйте, нажав на кнопку просмотра.

source: Reset
es: Restablecer
ru: Сбросить

source: SELECT AREA
es: SELECCIONAR ÁREA
ru: ВЫБОР ОБЛАСТИ

source: Detection face! Tap on display to see more information.
es: ¡Detección de rostro! Toque en la pantalla para ver más información.
ru: Распознавание лиц! Нажмите на дисплей, чтобы увидеть больше информации.

source: Detection face!
es: ¡Detección de rostro!
ru: Распознавание лица!

source: Upload media before.
es: Sube el medio antes.
ru: Загрузите медиафайл заранее.

source: UPLOAD AVATAR
es: SUBIR AVATAR
ru: ЗАГРУЗИТЬ АВАТАР

source: Male
es: Hombre
ru: Мужчина

source: Female
es: Mujer
ru: Женщина

source: All
es: Todo
ru: Все

source: Ethnic
es: Étnico
ru: Раса

source: Asian
es: Asiático
ru: Азиат

source: Black
es: Negro
ru: Черный

source: White
es: Blanco
ru: Белый

source: Indian
es: Indio
ru: Индус

source: Arab
es: Árabe
ru: Араб

source: Latino
ru: Латинос

source: Upload
es: Subir
ru: Загрузить

source: Upload a video (with a face, of course) and let’s get started!
es: Sube un video (con rostro, por supuesto) y comencemos!
ru: Загрузите видео (конечно же, с лицом) и начнем!

source: audio
ru: аудио

source: Upload your audio
es: Sube tu audio
ru: Загрузите свое аудио

source: Drag and drop audio
es: Arrastra y suelta el audio
ru: Перетащите аудио

source: upload a file.
es: sube un archivo.
ru: загрузить файл.

source: Record voice
es: Grabar voz
ru: Запись

source: Something went wrong. Please, try again.
es: Algo salió mal. Por favor, inténtalo de nuevo.
ru: Что-то пошло не так. Попробуйте еще раз.

source: Trim
es: Recortar
ru: Обрезать

source: Use the timeline selector to trim your audio. Anything longer than your video will be automatically cut off.
es: Usa el selector de la línea de tiempo para recortar tu audio. Cualquier cosa más larga que tu video será automáticamente recortada.
ru: Двигайте временную шкалу, чтобы обрезать аудио. Все, что длиннее вашего видео, будет автоматически обрезано.

source: Your audio is longer than
es: Tu audio es más largo que
ru: Ваше аудио длиннее, чем

source: Trim or redo for best results.
es: Recorta o rehace para obtener los mejores resultados.
ru: Обрежьте или переделайте для достижения наилучших результатов.

source: Attach and continue
es: Adjuntar y continuar
ru: Прикрепить и продолжить

source: Analysis content
es: Análisis de contenido
ru: Анализ контента

source: Utilize content analysis to determine whether the content originates from a deepfake created by Wunjo.
es: Utiliza el análisis de contenido para determinar si el contenido proviene de un deepfake creado por Wunjo.
ru: Используйте анализ контента, чтобы определить, является ли контент, созданным в Wunjo.

source: Gain insights and enhance confidence in the originality of content with this feature.
es: Obtén información y aumenta la confianza en la originalidad del contenido con esta función.
ru: Проверяет контент на оригинальность.

source: Scan
es: Escanear
ru: Сканировать

source: What is new?
es: ¿Qué hay de nuevo?
ru: Что нового?

source: Try Now
es: Prueba ahora
ru: Попробовать

source: What a twist!
es: ¡Vaya giro!
ru: Вот это поворот!

source: Okay
es: Está bien
ru: Хорошо

source: The cache folder directory
es: El directorio de la carpeta de caché
ru: Директория кэш-папки

source: contains invalid characters, such as Cyrillic, ideograms or space. Please ensure that the folder path contains only Latin letters, numbers, and allowed symbols, otherwise the program may not work correctly.
es: contiene caracteres no válidos, como cirílico, ideogramas o espacios. Por favor, asegúrate de que la ruta de la carpeta contenga solo letras latinas, números y símbolos permitidos, de lo contrario el programa puede no funcionar correctamente.
ru: содержит недопустимые символы, такие как кириллица, иероглифы или проблемы. Пожалуйста, убедитесь, что в пути папки содержатся только латиница, цифры и разрешённые символы, иначе программа может работать некорректно.

source: Select
es: Seleccionar
ru: Выбрать

source: Enter new path of cache folder
es: Introduce la nueva ruta de la carpeta de caché
ru: Введите новый путь к папке кэша

source: Scene detect
es: Detección de escena
ru: Обнаружение перехода

source: Transition detection also known as scene cut detection is an important video processing task that aims at finding interjoined scenes.
es: La detección de transiciones, también conocida como detección de cortes de escena, es una tarea importante en el procesamiento de video que tiene como objetivo encontrar escenas interconectadas.
ru: Обнаружение перехода сцен, также известное как обнаружение смены кадров, является важной задачей предобработки видео, направленной на поиск взаимосвязанных сцен.

source: Threshold
es: Umbral
ru: Погрешность

source: Scene transitions
es: Transiciones de escena
ru: Переходы сцен

source: Scene transitions and the first and last frame will be received.
es: Se recibirán las transiciones de escena, así como el primer y último fotograma.
ru: Будут получены переходы сцен, а также первый и последний кадр.

source: Lite setup
es: Configuración simplificada
ru: Упрощенная настройка

source: Tailor the
es: Personaliza el
ru: Подгоните модуль

source: module to perfectly match your needs.
es: módulo para adaptarlo perfectamente a tus necesidades.
ru: , под ваши потребности.

source: The cache directory stores configuration settings, neural network models, temporary files, and user-generated content. This directory requires a significant amount of hard disk space. You can change the location of the cache, including placing it in the
es: El directorio de caché almacena configuraciones, modelos de redes neuronales, archivos temporales y contenido generado por el usuario. Este directorio requiere una cantidad significativa de espacio en el disco duro. Puedes cambiar la ubicación del caché, incluyendo colocarlo en
ru: Каталог кэша хранит настройки конфигурации, модели нейронных сетей, временные файлы и пользовательский контент. Каталог требует значительного объема свободного места на жестком диске. Вы можете изменить расположение кэша, включая его размещение в

source: or on another drive.
es: o en otro disco.
ru: или на другом диске.

source: Please ensure that the new folder has the necessary permissions for processing and you have permissions to use folder. Avoid using non-Latin characters in folder names.
es: Asegúrate de que la nueva carpeta tenga los permisos necesarios para el procesamiento y que tengas permisos para usar la carpeta. Evita usar caracteres no latinos en los nombres de carpeta.
ru: Убедитесь, что новая папка имеет необходимые разрешения для обработки, и у вас есть права на использование этой папки. Избегайте использования нелатинских символов в именах папки и пути.

source: Example directories
es: Directorios de ejemplo
ru: Примеры каталогов

source: You are about to download a substantial amount of data for your project. Please note the following sizes
es: Estás a punto de descargar una cantidad significativa de datos para tu proyecto. Por favor, toma nota de los siguientes tamaños
ru: Вы собираетесь загрузить значительное количество данных. Обратите внимание на следующие размеры

source: Video Generation
es: Generación de video
ru: Генерация видео

source: General Models
es: Modelos generales
ru: Общие модели

source: The download process may take some time, so please be patient. All downloaded models will be stored in the
es: El proceso de descarga puede llevar algún tiempo, así que por favor, ten paciencia. Todos los modelos descargados se almacenarán en
ru: Процесс загрузки может занять некоторое время, поэтому, пожалуйста, наберитесь терпения. Все загруженные модели будут сохранены в

source: folder. If necessary, you can delete these files separately at any time.
es: la carpeta. Si es necesario, puedes eliminar estos archivos por separado en cualquier momento.
ru: папке. При необходимости вы можете удалить эти файлы отдельно в любое время.

source: Understand
es: Entendido
ru: Понятно

source: Translation on
es: Traducción activada
ru: Перевод на

source: Video
ru: Видео

source: Image
es: Imagen
ru: Изображения

source: Images group
es: Grupo de imágenes
ru: Группа

source: Audio
ru: Аудио

source: Favorites
es: Favoritos
ru: Избраное

source: Adult content
es: Contenido para adultos
ru: Взрослый контент

source: Copy
es: Copiar
ru: Копировать

source: Images output
es: Salida de imágenes
ru: Изображение

source: Hidden
es: Ocultar
ru: Скрыть

source: Save options
es: Opciones de guardado
ru: Сохранение

source: Motion control
es: Control de movimiento
ru: Видео параметры

source: Overview
es: Visión general
ru: Обзор

source: Developer Docs
es: Documentación para desarrolladores
ru: Документация разработчика

source: This is built using OpenAPI 3.0.0. In the API documentation, you can find examples of requests to various modules and a tutorial on how to use them. The schema section provides detailed descriptions of each parameter and their accepted values. Access to the API is token-based, with tokens available to Wunjo Pro subscribers at wunjo.online. The application can also run on localhost or a public link and be used as an API for your projects. This is a Beta API, introduced in the latest version. For any questions, contact support@wunjo.online.
es: Está construido utilizando OpenAPI 3.0.0. En la documentación de la API, puedes encontrar ejemplos de solicitudes a varios módulos y un tutorial sobre cómo usarlos. La sección de esquema proporciona descripciones detalladas de cada parámetro y sus valores aceptados. El acceso a la API se basa en tokens, que están disponibles para suscriptores de Wunjo Pro en wunjo.online. La aplicación también puede ejecutarse en localhost o mediante un enlace público y usarse como una API para tus proyectos. Esta es una API Beta, introducida en la última versión. Para cualquier pregunta, contacta a support@wunjo.online.
ru: Построено с использованием OpenAPI 3.0.0. В документации вы найдете примеры запросов к различным модулям и руководство по их использованию. Раздел схемы предоставляет подробные описания каждого параметра и их допустимые значения. Доступ к API осуществляется через токен, который предоставляется только подписчикам Wunjo Pro на сайте wunjo.online. Приложение также может работать на localhost или публичной ссылке и использоваться как API для ваших проектов. Это Бета-версия API, представленная в последней версии. По всем вопросам обращайтесь на support@wunjo.online.
