Repository: wladradchenko/wunjo.wladradchenko.ru
Catalog: portable/src/wunjo/translations/*/LC_MESSAGES/messages.po
Languages: es, ru

source: Alright, listen up! Drop threshold to weaken scene transition detection. Nail that threshold, and watch your new scene transition!
es: ¡Bien, escuchen! Baja el umbral para debilitar la detección de transiciones entre escenas. Ajusta el umbral y mira cómo tu nueva escena transita perfectamente.
ru: Итак, внимание! Уменьшите погрешность, чтобы ослабить обнаружение переходов между сценами. Подберите правильный порог и наблюдайте, как ваша новая сцена плавно переходит!

source: Alright, listen up! Increase threshold to do scene transition detection more accuracy. Nail that threshold, and watch your new scene transition!
es: ¡Bien, escuchen! Aumenta el umbral para hacer que la detección de transiciones entre escenas sea más precisa. Ajusta el umbral y observa cómo tu nueva escena hace una transición perfecta.
ru: Итак, внимание! Увеличьте погрешность, чтобы повысить точность обнаружения переходов между сценами. Подберите правильный порог и наблюдайте, как ваша новая сцена плавно переходит!

source: Style
es: Estilo
ru: Стиль

source: Add a new custom Stable Diffusion 1.5 model to the configuration file located at
es: Agrega un nuevo modelo personalizado de Stable Diffusion 1.5 al archivo de configuración ubicado en
ru: Добавьте новую пользовательскую модель Stable Diffusion 1.5 в конфигурационный файл, расположенный в каталоге

source: Modify specific objects or entire scenes with simple text prompts. Experience advanced visual manipulation!
es: Modifica objetos específicos o escenas completas con simples comandos de texto. ¡Experimenta una manipulación visual avanzada!
ru: Изменяйте конкретные объекты или целые сцены с помощью простых текстовых команд.

source: Control restyle
es: Restilo manual
ru: Ручной рестайлинг

source: Scene transitions with frames interval
es: Transiciones de escena con intervalo de fotogramas
ru: Переходы между сценами с интервалом кадров

source: and the first and last frame will be received.
es: y se recibirán el primer y último fotograma.
ru: и будут получены первый и последний кадры.

source: Something wrong...During create task.
es: Algo salió mal... Durante la creación de la tarea.
ru: Что-то не так... Во время создания задачи.

source: diffuser
es: restilo de contenido
ru: рестайлинга контента

source: separator
es: separador de audio
ru: аудио разделителя

source: Token
ru: Токен

source: Don’t have an account for Wunjo Pro?
es: ¿No tienes una cuenta en Wunjo Pro?
ru: Нет аккаунта?

source: Sign up
es: Registrarse
ru: Регистрация

source: This feature is premium and available after login. New users get a
es: Esta función es premium y está disponible después de iniciar sesión. Los nuevos usuarios obtienen una
ru: Премиум функционал доступен после авторизации. Новые пользователи получают

source: free tokens
es: fichas gratis
ru: бесплатные токены

source: to explore all features.
es: para explorar todas las funciones.
ru: для ознакомления со всеми возможностями.

source: Turn on the internet and reload
es: Enciende el internet y recarga
ru: Включите интернет и перезагрузите

source: Invalid login credentials
es: Credenciales de inicio de sesión inválidas
ru: Неверные учетные данные

source: An unexpected error has occurred. Please contact support@wunjo.online
es: Ha ocurrido un error inesperado. Por favor, contacta a support@wunjo.online
ru: Произошла непредвиденная ошибка. Пожалуйста, свяжитесь с support@wunjo.online

source: Subscription expired. Renew your license key in wunjo.online.
es: La suscripción ha expirado. Renueva tu clave de licencia en wunjo.online.
ru: Подписка истекла. Обновите свой лицензионный токен на wunjo.online.

source: The license key is not valid
es: La clave de licencia no es válida
ru: Лицензионный токен недействителен

source: Generate image composition
es: Generar composición de imagen
ru: Создать композицию изображений

source: Width
es: Ancho
ru: Ширина

source: Height
es: Altura
ru: Высота

source: Image composition
es: Composición de imagen
ru: Композиция изображений

source: Generate an image composition by prompt and images
es: Genera una composición de imagen a partir de un texto y unas imágenes
ru: Сгенерируйте композицию изображения по подсказке и изображениям

source: Create photos from images and a prompt. Modify age, environment, and characters while preserving identity with realism.
es: Crea fotos a partir de imágenes y un texto. Modifica la edad, el entorno y los personajes mientras preservas su identidad con realismo.
ru: Создавайте фотографии из изображений и подсказки. Измените возраст, окружение и персонажей, сохраняя при этом индивидуальность с реализмом.

source: Use the prompt field to describe your composition. Click on an image to insert its placeholder into the text automatically. You can add as many images as you like. Example placeholder format: A man image_1 in t-short image_2. Also you can use coefficient. For example, dog:0.8, cat:0.2 in one prompt. The maximum number of symbols is 3000.
es: Utilice el campo de texto para describir su composición. Haga clic en una imagen para insertar su marcador de posición automáticamente en el texto. Puede agregar tantas imágenes como desee. Formato de marcador de posición de ejemplo: Un hombre image_1 con una camiseta image_2. También puede usar coeficientes. Por ejemplo, dog:0.8, cat:0.2 en un solo texto. El número máximo de símbolos es 3000.
ru: Используйте поле подсказки для описания вашей композиции. Щелкните на изображение, чтобы автоматически вставить его в текст. Вы можете добавить столько изображений, сколько пожелаете. Пример формата заполнителя: Мужчина image_1 в футболке image_2. Также можно использовать коэффициенты. Например, dog:0.8, cat:0.2 в одной подсказке. Максимальное количество символов — 3000.

source: sec
es: seg
ru: сек

source: Chat
ru: Чат

source: automatically edits videos <br> and answers questions.
es: la red neuronal encuentra automáticamente, edita videos <br> y responde preguntas.
ru: нейронная сеть находит автоматически, редактирует видео <br> и отвечает на вопросы.

source: The neural network now edits a long video into a short one with highlights and answers questions about them, as well as recommends music.
es: La red neuronal ahora edita un video largo en uno corto con los momentos destacados y responde preguntas sobre ellos, además de recomendar música.
ru: Нейросеть редактирует длинное видео в короткое с основными моментами и отвечает на вопросы о видео.

source: Edit a long video into a short one with highlights
es: Edita un video largo en uno corto con los momentos destacados
ru: Отредактируйте длинное видео в короткое с основными моментами

source: Ready to analyze the video and answer all the questions!
es: ¡Listo para analizar el video y responder todas las preguntas!
ru: Анализ видео, чтобы получить ответы на все вопросы!

source: If you want to slow things down a bit, choose a longer segment length. That'll give you fewer, longer chunks, which means less rush, more moments to shine, but a bit less of that fast-paced flow. It's all about balancing energy and detail, so pick what suits your video vibe best!
es: Si quieres ralentizar un poco las cosas, elige una longitud de segmento más larga. Esto te dará menos partes, pero más largas, lo que significa menos prisa, más momentos para brillar, pero un poco menos de ese flujo rápido. Todo se trata de equilibrar la energía y los detalles, ¡así que elige lo que mejor se adapte al estilo de tu video!
ru: Если вы хотите немного замедлить процесс, выберите более длинную продолжительность сегмента. Это даст вам меньше, но более длинных частей, что означает меньше спешки, больше моментов для ярких событий, но немного меньше быстрого темпа. Важно найти баланс между энергией и деталями, поэтому выберите то, что лучше всего подходит для настроения вашего видео!

source: Alright, time to set the pace! The segment length is like choosing the perfect stride for your video’s rhythm. Go with a shorter segment length, and you'll get quick, snappy video chunks — more dynamic, more action, keeping the energy high.
es: ¡Muy bien, es hora de establecer el ritmo! La longitud del segmento es como elegir el paso perfecto para el ritmo de tu video. Elige una longitud de segmento más corta, y obtendrás partes de video rápidas y dinámicas: más acción, manteniendo la energía alta.
ru: Хорошо, время задать ритм! Длина сегмента — это как выбор идеального шага для ритма вашего видео. Выберите более короткую длину сегмента, и вы получите быстрые, динамичные части видео — больше динамики, больше действия, поддерживающее высокий уровень энергии.

source: Segment length
es: Longitud del segmento
ru: Длина сегмента

source: You are a highlight editor. List archetypal dramatic moments that would make compelling highlights if they appear in the video. Each moment should be specific enough to be recognizable but generic enough to potentially exist in other videos of this type.
es: Eres un editor de momentos destacados. Enumera los momentos dramáticos arquetípicos que serían momentos destacados si aparecieran en el video. Cada momento debe ser lo suficientemente específico para ser reconocible, pero lo suficientemente genérico como para existir en otros videos de este tipo.
ru: Вы — редактор ярких моментов. Перечислите архетипичные драматические моменты, которые могут стать интересными яркими моментами, если они появятся в видео. Каждый момент должен быть достаточно специфичным, чтобы его можно было распознать, но достаточно универсальным, чтобы он мог встречаться и в других видео этого типа.

source: You are a helpful visual-language assistant that can understand videos and edit. You are tasked helping the user to create highlight reels for videos. Highlights should be rare and important events in the video in question.
es: Eres un asistente útil de lenguaje visual que puede entender videos y editarlos. Tu tarea es ayudar al usuario a crear resúmenes de momentos destacados para los videos. Los momentos destacados deben ser eventos raros e importantes en el video en cuestión.
ru: Вы — полезный ассистент визуального языка, который может понимать видео и редактировать их. Ваша задача — помочь пользователю создавать нарезки ярких моментов для видео. Яркие моменты должны быть редкими и важными событиями в видео.

source: (Optional) Describe how to edit a video
es: (Opcional) Describe cómo editar un video
ru: (Необязательно) Опишите, как редактировать видео

source: Yikes! Where is video? Attach its and continue.
es: ¡Vaya! ¿Dónde está el video? Adjunta el video y continúa.
ru: Ой! Где видео? Прикрепите его и продолжите.

source: Smart crop
es: Recorte inteligente
ru: Умная обрезка

source: Enable smart crop to create videos for YouTube, Tik Tok, Instagram, etc. Allows you to change any aspect ratio for your video using artificial intelligence and focus on interest objects and speakers.
es: Activa el recorte inteligente para crear videos para YouTube, TikTok, Instagram, etc. Permite cambiar cualquier relación de aspecto de tu video usando inteligencia artificial y enfocarse en objetos de interés y personas que hablan.
ru: Включите интеллектуальную обрезку для создания видео для YouTube, Tik Tok, Instagram и т. д. Позволяет изменять любое соотношение сторон видео с помощью искусственного интеллекта и фокусироваться на интересующих объектах и говорящих. Идеально для подкастов.

source: Aspect ratio select
es: Seleccionar relación de aspecto
ru: Выбор соотношения сторон

source: An custom artificial intelligence system analyzes video frames to detect key subjects and speaking individuals, aligning lip movements with speech to focus on the most meaningful parts of the content. Perfect to create preview and shorts video.
es: Un sistema personalizado de inteligencia artificial analiza los fotogramas del video para detectar sujetos clave y personas que hablan, alineando los movimientos de los labios con el audio para centrarse en las partes más relevantes del contenido. Perfecto para crear vistas previas y videos cortos.
ru: Специальная система искусственного интеллекта анализирует видеокадры, выявляя ключевые объекты и говорящих людей, синхронизируя движения губ с речью, чтобы сосредоточиться на наиболее значимых фрагментах контента. Идеально подходит для создания превью и коротких видеороликов.

source: Highlights
es: Momentos destacados
ru: Яркие моменты

source: Drag and drop a file or select one. You can upload a video and write how to edit the video, but the latter is not necessary. For instructions on how to use the Highlights module, check out this
es: Arrastra y suelta un archivo o selecciona uno. Puedes cargar un video y escribir cómo editarlo, pero esto no es necesario. Para obtener instrucciones sobre cómo usar el módulo de Momentos Destacados, consulta esto
ru: Перетащите файл или выберите его. Вы можете загрузить видео и написать, как его отредактировать, но это не обязательно. Для инструкций по использованию модуля «Яркие моменты» посмотрите это

source: Your answer will appear in this textarea.
es: Tu respuesta aparecerá en este campo de texto.
ru: Ваш ответ появится в этом поле для ввода.

source: You can ask what is happening in the video or its segment, key takeaways, which sounds to use for editing, or any other question based on the video. The maximum number of symbols is 3000.
es: Puedes preguntar qué está pasando en el video o en su segmento, las conclusiones clave, qué sonidos usar para editar, o cualquier otra pregunta relacionada con el video. El número máximo de caracteres es 3000.
ru: Вы можете задать вопросы о том, что происходит в видео или его сегменте, о ключевых моментах, о звуках, которые можно использовать для редактирования, или любой другой вопрос, связанный с видео. Максимальное количество символов — 3000.

source: What is your question?
es: ¿Cuál es tu pregunta?
ru: Есть вопросы?

source: Number of inference steps
es: Número de pasos de inferencia
ru: Количество шагов генерации

source: Upload an image with a face to make some magic happen!
es: ¡Sube una imagen con una cara para hacer que ocurra algo mágico!
ru: Загрузите изображение с лицом, чтобы сделать магию!

source: Metadata
es: Metadatos
ru: Метаданные

source: Preview of the request
es: Vista previa de la solicitud
ru: Предпросмотр запроса

source: Parameters that do not depend on files will be applied. If a parameter is related to a file (e.g., its size, duration, or selected face), it cannot be used without the file.
es: Se aplicarán solo los parámetros que no dependan de archivos. Si un parámetro está relacionado con un archivo (por ejemplo, su tamaño, duración o cara seleccionada), no se podrá usar sin el archivo.
ru: Будут применяться только параметры, не зависящие от файлов. Если параметр связан с файлом (например, его размер, длительность или выбранное лицо), он не может быть использован без файла.

source: Assistant
es: Asistente
ru: Помощник

source: Ready to transcribe or to analyze the content and answer all the questions!
es: ¡Listo para transcribir o analizar el contenido y responder todas las preguntas!
ru: Расшифровывает или анализирует содержание и отвечает на все вопросы!

source: Transcribe
es: Transcribir
ru: Транскрибировать

source: Visual Method
es: Método visual
ru: Визуальный метод

source: The method works with video by analyzing visual elements, remembering all movements, colors, and objects. It’s ideal for sports events or movies.
es: El método trabaja con video analizando elementos visuales, recordando todos los movimientos, colores y objetos. Es ideal para eventos deportivos o películas.
ru: Метод работает с видео, анализируя визуальные элементы и запоминая движения, цвета и объекты. Идеален для спортивных событий или фильмов.

source: Visual
es: Modelo visual
ru: Визуальная модель

source: Sound Method
es: Método de sonido
ru: Звуковой метод

source: The method works with audio based on speech, capturing what people say. Perfect for podcasts, interviews, or news.
es: El método funciona con audio basado en el habla, capturando lo que dicen las personas. Perfecto para pódcasts, entrevistas o noticias.
ru: Метод работает с аудио, ориентируясь на речь и фиксируя сказанное. Подходит для подкастов, интервью или новостей.

source: Sound
es: Modelo de sonido
ru: Звуковая модель

source: Monitor the user is completed tasks throughout the day.
es: Rastrea el historial de tareas completadas del usuario.
ru: Отслеживайте историю выполненных задач пользователя за день.

source: No tasks found
es: No se encontraron tareas
ru: Задачи не найдены

source: There are no tasks in the queue.
es: No hay tareas en la cola.
ru: В очереди нет задач.

source: Got an idea for a feature? Drop it in our
es: ¿Tienes una idea para una función? Compártela en nuestro
ru: Есть идея для функции? Поделитесь ею в

source: History session
es: Historial de sesión
ru: История сеанса

source: You can see your session to always have quick access to generations.
es: Puedes ver tu sesión para tener acceso rápido a las generaciones anteriores.
ru: Вы можете просматривать сеанс, чтобы всегда иметь быстрый доступ к сгенерированным результатам.

source: Maximum duration (min)
es: Duración máxima (min)
ru: Продолжительность (мин)

source: Click any banner to start progress
es: Haz clic en cualquier banner para comenzar
ru: Нажмите на баннер, чтобы начать прогресс

source: Waiting
es: Esperando
ru: Ожидание

source: Subscribe to unlock
es: Suscríbete para desbloquear
ru: Подпишитесь для разблокировки

source: free
es: gratis
ru: бесплатно

source: day
es: día
ru: день

source: Watch ad
es: Ver anuncio
ru: Посмотреть рекламу

source: Monthly limit reached
es: Límite mensual alcanzado
ru: Достигнут месячный лимит

source: Cut
es: Cortar
ru: Вырезать

source: Smart cutter
es: Corte inteligente de file
ru: Умная обрезка файла

source: Once the text appears, highlight words or phrases to select video or audio segments to edit a media file. Click again to deselect.
es: Una vez que aparezca el texto, resalta palabras o frases para seleccionar los segmentos de video que deseas editar. Haz clic nuevamente para deseleccionar.
ru: После появления текста выделите слова или фразы, чтобы выбрать фрагменты видео или аудио для редактирования медиафайла. Щелкните или выделите ещё раз, чтобы снять выделение.

source: Once the text appears, highlight words or phrases to select video or audio segments to edit a media file.
es: Una vez que aparezca el texto, resalta palabras o frases para seleccionar los segmentos de video que deseas editar.
ru: После появления текста выделите слова или фразы, чтобы выбрать фрагменты видео или аудио для редактирования медиафайла.

source: Processing... A file timestamps is on its way.
ru: Обработка... Файл с временными метками в пути.

source: No speech found in a media.
es: No se encontró voz en el archivo multimedia.
ru: В файле речи не обнаружено.

source: Want to try the full experience?
es: ¿Quieres probar la experiencia completa?
ru: Хотите попробовать расширенные возможности?

source: Every month, you can activate all premium features for free and get early access to new updates — download the latest version from
es: Cada mes puedes activar todas las funciones premium de forma gratuita y obtener acceso anticipado a las nuevas actualizaciones — descarga la última versión desde
ru: Каждый месяц вы можете бесплатно активировать полный функционал и получать ранние обновления — загрузите актуальную версию с

source: Follow the author’s channel to stay up to date with new features and releases.
es: Sigue el canal del autor para estar al tanto de las nuevas funciones y actualizaciones.
ru: Подписывайтесь на канал автора, чтобы быть в курсе новинок и обновлений.

source: It doesn’t matter if your content is created in a community edition version or a professional subscription. If it has nothing prohibited or is not intended to discredit anyone then, whatever you create using Wunjo can be used commercially, or non-commercially.
es: No importa si tu contenido se crea en una versión de edición comunitaria o una suscripción profesional. Si no tiene nada prohibido o no está destinado a desacreditar a nadie, entonces, cualquier cosa que crees con Wunjo puede ser utilizada comercial o no comercialmente.

source: Seed
es: Semilla

source: Strength
es: Fuerza

source: Scale
es: Escala

source: NEW
es: NUEVO

source: Control strength
es: Fuerza de control

source: infinity
es: infinito

source: credits
es: créditos

source: Guidance scale
es: Escala de guía

source: Processing... A video timestamps is on its way.
es: Procesando... Los segmentos de video con marcas de tiempo estarán disponibles pronto.
