Repository: wladradchenko/wunjo.wladradchenko.ru
Catalog: portable/src/wunjo/translations/*/LC_MESSAGES/messages.po
Languages: es, ru

source: Wow, that’s a lengthy audio! Please upload an audio that’s less than
es: ¡Vaya, es un audio muy largo! Por favor, sube un audio de menos de
ru: Ого, это очень длинное аудио! Пожалуйста, загрузите аудио длительностью меньше

source: seconds long. Let’s keep it short!
es: segundos de duración. ¡Mantengámoslo corto!
ru: секунд. Давайте сделаем его короче!

source: Error reading file. Please try again.
es: Error al leer el archivo. Por favor, intente de nuevo.
ru: Ошибка чтения файла. Пожалуйста, попробуйте снова.

source: Yikes! Looks like you not uploaded or recorded speech or sample.
es: ¡Vaya! Parece que no has subido ni grabado un discurso o muestra.
ru: Ой! Похоже, вы не загрузили или не записали речь или образец.

source: Yikes! Looks like you not wrote text to create speech.
es: ¡Vaya! Parece que no escribiste texto para crear el discurso.
ru: Ой! Похоже, вы не написали текст для создания речи.

source: Yikes! Looks like an alien format. Stick to audio for now.
es: ¡Vaya! Parece que es un formato desconocido. Mantente con audio por ahora.
ru: Ой! Похоже, это неизвестный формат. Пока придерживайтесь аудио.

source: Imitate accent
es: Imitar acento
ru: Имитация акцента

source: Activate manual audio creation. Record yourself with any accent or speed, and watch your voice transform into a cloned!
es: Activa la creación manual de audio. Graba tu voz con cualquier acento o velocidad, ¡y observa cómo se convierte en una voz clonada!
ru: Активируйте ручное создание аудио. Запишите себя с любым акцентом или скоростью, и наблюдайте, как ваш голос превращается в клонированный!

source: Filename
es: Nombre del archivo
ru: Имя файла

source: Language
es: Idioma
ru: Язык

source: Fake detector
es: Detector de falsificaciones
ru: Детектор подделок

source: Got a sneaky suspicion about some audio? Ready to sniff out those clone voice? Just hit that button.
es: ¿Tienes sospechas sobre algún audio? ¿Listo para detectar esos clones de voz? Solo presiona ese botón.
ru: Готовы выявить клонированные голоса? Просто запустите анализ.

source: Analysis
es: Análisis
ru: Анализ

source: Set text explain
es: Explicación de agregar texto
ru: Объяснение добавления текста

source: Ready to have some fun? Click here to type your text to watch after submit as it turns into a cloned voice masterpiece!
es: ¿Listo para divertirte? ¡Haz clic aquí para escribir tu texto y observar cómo se convierte en una obra maestra de voz clonada!
ru: Нажмите здесь, чтобы ввести текст и наблюдать, как он превратится в шедевр клонированного голоса!

source: Set text
es: Agregar texto
ru: Добавить текст

source: Load audio explain
es: Explicación de carga de audio
ru: Объяснение загрузки аудио

source: This audio extracts the base speaker tone. A short audio clip is usually enough, but longer clips improve quality.
es: Este audio extrae el tono base del hablante. Un clip de audio corto suele ser suficiente, pero los clips más largos mejoran la calidad.
ru: Аудио извлекает основной тон говорящего. Достаточно короткого аудио, но длинное аудио улучшит качество.

source: Create sample
es: Crear muestra
ru: Создать образец

source: This audio will be used to extract the base speaker tone color embedding. Typically a very short audio should be sufficient, but increasing the audio length will also improve the output audio quality.
es: Este audio se utilizará para extraer la incrustación del tono base del hablante. Normalmente, un audio muy corto debería ser suficiente, pero aumentar la longitud del audio también mejorará la calidad del audio de salida.
ru: Аудио для извлечения тональности говорящего. Обычно достаточно очень короткого аудио, но увеличение длины аудио улучшит качество результата.

source: Artificial intelligence (AI) is intelligence demonstrated by machines, in contrast to the natural intelligence displayed by humans and animals. Leading AI textbooks define the field as the study of intelligent agents.
es: La inteligencia artificial (IA) es la inteligencia demostrada por las máquinas, en contraste con la inteligencia natural que muestran los humanos y los animales. Los principales libros de texto de IA definen el campo como el estudio de agentes inteligentes.
ru: Искусственный интеллект (ИИ) — это интеллект, демонстрируемый машинами, в отличие от естественного интеллекта, проявляемого людьми и животными. Ведущие учебники по ИИ определяют эту область как изучение интеллектуальных агентов.

source: It was the best of times, it was the worst of times, it was the age of wisdom, it was the age of foolishness, it was the epoch of belief, it was the epoch of incredulity, it was the season of Light, it was the season of Darkness.
es: Era el mejor de los tiempos, era el peor de los tiempos, era la era de la sabiduría, era la era de la necedad, era la época de la creencia, era la época de la incredulidad, era la temporada de la Luz, era la temporada de la Oscuridad.
ru: Это было лучшее из времен, это было худшее из времен, это был век мудрости, это был век глупости, это была эпоха веры, это была эпоха неверия, это был сезон Света, это был сезон Тьмы.

source: The quick brown fox jumps over the lazy dog. This sentence is famous because it includes every letter in the English alphabet, making it a great tool for typing practice.
es: El rápido zorro marrón salta sobre el perro perezoso. Esta frase es famosa porque incluye todas las letras del alfabeto inglés, lo que la convierte en una excelente herramienta para practicar la mecanografía.
ru: Быстрая коричневая лиса прыгает через ленивую собаку. Это предложение знаменито тем, что включает каждую букву английского алфавита, что делает его отличным инструментом для практики печати.

source: A journey of a thousand miles begins with a single step. This ancient Chinese proverb reminds us that great things start from humble beginnings.
es: Un viaje de mil millas comienza con un solo paso. Este antiguo proverbio chino nos recuerda que las grandes cosas comienzan desde humildes comienzos.
ru: Путешествие в тысячу миль начинается с одного шага. Эта древняя китайская пословица напоминает нам, что великие вещи начинаются с малого.

source: To be, or not to be, that is the question: Whether ’tis nobler in the mind to suffer the slings and arrows of outrageous fortune, or to take arms against a sea of troubles and by opposing end them.
es: Ser o no ser, esa es la cuestión: Si es más noble en la mente sufrir los golpes y flechas de una fortuna escandalosa, o tomar las armas contra un mar de problemas y, al oponerse, ponerles fin.
ru: Быть или не быть, вот в чем вопрос: Достойно ли терпеть удары и стрелы неистовой судьбы или восстать против моря бед и победить их.

source: The theory of relativity usually encompasses two interrelated theories by Albert Einstein: special relativity and general relativity. It revolutionized the understanding of space, time, and gravity.
es: La teoría de la relatividad suele abarcar dos teorías interrelacionadas de Albert Einstein: la relatividad especial y la relatividad general. Revolucionó la comprensión del espacio, el tiempo y la gravedad.
ru: Теория относительности обычно охватывает две взаимосвязанные теории Альберта Эйнштейна: специальную и общую теорию относительности. Она революционизировала понимание пространства, времени и гравитации.

source: The mitochondrion is often referred to as the powerhouse of the cell. These organelles are responsible for generating most of the cell’s supply of adenosine triphosphate (ATP), used as a source of chemical energy.
es: El mitocondrio a menudo se denomina la central eléctrica de la célula. Estos orgánulos son responsables de generar la mayor parte del suministro celular de trifosfato de adenosina (ATP), utilizado como fuente de energía química.
ru: Митохондрию часто называют энергетической станцией клетки. Эти органеллы отвечают за генерацию большинства запасов аденозинтрифосфата (АТФ) клетки, используемого в качестве источника химической энергии.

source: The only thing we have to fear is fear itself. This famous quote by Franklin D. Roosevelt during his inaugural address aims to inspire courage and confidence in the face of challenges.
es: Lo único que debemos temer es al propio miedo. Esta famosa cita de Franklin D. Roosevelt durante su discurso inaugural tiene como objetivo inspirar coraje y confianza frente a los desafíos.
ru: Единственное, чего мы должны бояться, это самого страха. Эта известная цитата Франклина Д. Рузвельта из его инаугурационной речи призвана вдохновить на смелость и уверенность перед лицом испытаний.

source: In three words I can sum up everything I’ve learned about life: it goes on. This quote by Robert Frost succinctly captures the essence of resilience and the passage of time.
es: En tres palabras puedo resumir todo lo que he aprendido sobre la vida: sigue adelante. Esta cita de Robert Frost captura de manera sucinta la esencia de la resiliencia y el paso del tiempo.
ru: Тремя словами я могу выразить все, что я узнал о жизни: она продолжается. Эта цитата Роберта Фроста лаконично передает суть стойкости и течения времени.

source: The cat sat on the mat. This simple sentence is often used to teach basic sentence structure in English grammar.
es: El gato se sentó en la alfombra. Esta frase simple se usa a menudo para enseñar la estructura básica de las oraciones en la gramática inglesa.
ru: Кот сидел на коврике. Это простое предложение часто используется для обучения базовой структуре предложений в английской грамматике.

source: E=mc². This famous equation by Albert Einstein establishes the relationship between mass (m) and energy (E), with c representing the speed of light in a vacuum.
es: E=mc². Esta famosa ecuación de Albert Einstein establece la relación entre masa (m) y energía (E), con c representando la velocidad de la luz en el vacío.
ru: E=mc². Это знаменитое уравнение Альберта Эйнштейна устанавливает связь между массой (m) и энергией (E), где c представляет скорость света в вакууме.

source: The Great Wall of China is one of the greatest wonders of the world. It was built to protect Chinese states and empires against the raids and invasions of the nomadic groups of the Eurasian Steppe.
es: La Gran Muralla China es una de las mayores maravillas del mundo. Fue construida para proteger los estados e imperios chinos contra las incursiones e invasiones de los grupos nómadas de la estepa euroasiática.
ru: Великая китайская стена является одним из величайших чудес света. Она была построена для защиты китайских государств и империй от набегов и вторжений кочевых групп Евразийской степи.

source: Curiosity killed the cat, but satisfaction brought it back. This proverb warns of the dangers of unnecessary investigation or experimentation, but also highlights the rewarding nature of discovery.
es: La curiosidad mató al gato, pero la satisfacción lo devolvió. Este proverbio advierte sobre los peligros de la investigación o experimentación innecesarias, pero también resalta la naturaleza gratificante del descubrimiento.
ru: Любопытство убило кошку, но удовлетворение вернуло ее к жизни. Эта пословица предостерегает от опасностей ненужных исследований или экспериментов, но также подчеркивает наградную природу открытий.

source: The universe is under no obligation to make sense to you. This quote by Neil deGrasse Tyson underscores the complexity and mystery of the cosmos.
es: El universo no tiene la obligación de tener sentido para ti. Esta cita de Neil deGrasse Tyson subraya la complejidad y el misterio del cosmos.
ru: Вселенная не обязана быть понятной для вас. Эта цитата Нила Деграсса Тайсона подчеркивает сложность и загадочность космоса.

source: In the end, we will remember not the words of our enemies, but the silence of our friends. This quote by Martin Luther King Jr. highlights the importance of support and solidarity.
es: Al final, no recordaremos las palabras de nuestros enemigos, sino el silencio de nuestros amigos. Esta cita de Martin Luther King Jr. resalta la importancia del apoyo y la solidaridad.
ru: В конце концов, мы будем помнить не слова наших врагов, а молчание наших друзей. Эта цитата Мартина Лютера Кинга-младшего подчеркивает важность поддержки и солидарности.

source: Success is not final, failure is not fatal: It is the courage to continue that counts. This quote by Winston Churchill emphasizes perseverance and resilience.
es: El éxito no es definitivo, el fracaso no es fatal: lo que cuenta es el coraje de continuar. Esta cita de Winston Churchill enfatiza la perseverancia y la resiliencia.
ru: Успех не является окончательным, неудача не смертельна: важно мужество продолжать. Эта цитата Уинстона Черчилля подчеркивает настойчивость и стойкость.

source: The only limit to our realization of tomorrow is our doubts of today. This quote by Franklin D. Roosevelt encourages overcoming self-doubt to achieve future goals.
es: El único límite para nuestra realización del mañana son nuestras dudas de hoy. Esta cita de Franklin D. Roosevelt anima a superar la autocrítica para alcanzar metas futuras.
ru: Единственный предел к нашему достижению завтрашнего дня — это наши сегодняшние сомнения. Эта цитата Франклина Д. Рузвельта побуждает преодолевать сомнения, чтобы достичь будущих целей.

source: To infinity and beyond! This catchphrase from Buzz Lightyear in Toy Story inspires boundless exploration and adventure.
es: ¡Hasta el infinito y más allá! Esta frase de Buzz Lightyear en Toy Story inspira una exploración y aventura sin límites.
ru: К бесконечности и дальше! Эта крылатая фраза Базза Лайтера из «Истории игрушек» вдохновляет на бескрайние исследования и приключения.

source: The only way to do great work is to love what you do. This quote by Steve Jobs underscores the importance of passion in achieving excellence.
es: La única forma de hacer un gran trabajo es amar lo que haces. Esta cita de Steve Jobs subraya la importancia de la pasión para lograr la excelencia.
ru: Единственный способ делать великую работу — это любить то, что ты делаешь. Эта цитата Стива Джобса подчеркивает важность страсти для достижения совершенства.

source: The greatest glory in living lies not in never falling, but in rising every time we fall. This quote by Nelson Mandela celebrates resilience and persistence.
es: La mayor gloria en la vida no está en no caer nunca, sino en levantarnos cada vez que caemos. Esta cita de Nelson Mandela celebra la resiliencia y la persistencia.
ru: Величайшая слава в жизни заключается не в том, чтобы никогда не падать, а в том, чтобы подниматься каждый раз, когда мы падаем. Эта цитата Нельсона Манделы воспевает стойкость и настойчивость.

source: Imagination is more important than knowledge. For knowledge is limited, whereas imagination embraces the entire world. This quote by Albert Einstein highlights the power of creativity.
es: La imaginación es más importante que el conocimiento. Porque el conocimiento es limitado, mientras que la imaginación abarca todo el mundo. Esta cita de Albert Einstein resalta el poder de la creatividad.
ru: Воображение важнее знания. Знание ограничено, тогда как воображение охватывает весь мир. Эта цитата Альберта Эйнштейна подчеркивает силу творчества.

source: Life is what happens when you’re busy making other plans. This quote by John Lennon reminds us to appreciate the present moment.
es: La vida es lo que sucede mientras estás ocupado haciendo otros planes. Esta cita de John Lennon nos recuerda apreciar el momento presente.
ru: Жизнь – это то, что происходит, пока вы заняты составлением других планов. Эта цитата Джона Леннона напоминает нам о важности ценить настоящий момент.

source: The best way to predict the future is to invent it. This quote by Alan Kay encourages proactive innovation.
es: La mejor manera de predecir el futuro es inventarlo. Esta cita de Alan Kay anima a la innovación proactiva.
ru: Лучший способ предсказать будущее – это создать его. Эта цитата Алана Кея вдохновляет на активные инновации.

source: Do or do not, there is no try. This quote by Yoda from Star Wars emphasizes commitment and determination.
es: Hazlo o no lo hagas, no hay intentos. Esta cita de Yoda de Star Wars enfatiza el compromiso y la determinación.
ru: Делай или не делай, нет попыток. Эта цитата Йоды из Звездных войн подчеркивает важность приверженности и решительности.

source: The more that you read, the more things you will know. The more that you learn, the more places you’ll go. This quote by Dr. Seuss promotes the value of education.
es: Cuanto más leas, más cosas sabrás. Cuanto más aprendas, más lugares irás. Esta cita de Dr. Seuss promueve el valor de la educación.
ru: Чем больше вы читаете, тем больше вы узнаете. Чем больше вы учитесь, тем дальше вы пойдете. Эта цитата доктора Сьюза подчеркивает ценность образования.

source: The purpose of our lives is to be happy. This simple yet profound quote by Dalai Lama emphasizes the importance of happiness.
es: El propósito de nuestras vidas es ser felices. Esta cita simple pero profunda del Dalai Lama enfatiza la importancia de la felicidad.
ru: Цель нашей жизни – быть счастливыми. Эта простая, но глубокая цитата Далай-ламы подчеркивает важность счастья.

source: It always seems impossible until it’s done. This quote by Nelson Mandela inspires perseverance in the face of challenges.
es: Siempre parece imposible hasta que se logra. Esta cita de Nelson Mandela inspira perseverancia frente a los desafíos.
ru: Всегда кажется невозможным, пока это не сделано. Эта цитата Нельсона Манделы вдохновляет на упорство перед лицом трудностей.

source: I have not failed. I’ve just found 10,000 ways that won’t work. This quote by Thomas Edison celebrates the process of learning through experimentation.
es: No he fracasado. Solo he encontrado 10,000 formas que no funcionan. Esta cita de Thomas Edison celebra el proceso de aprender a través de la experimentación.
ru: Я не потерпел неудачу. Я просто нашел 10 000 способов, которые не работают. Эта цитата Томаса Эдисона воспевает процесс обучения через эксперименты.

source: If you want to go fast, go alone. If you want to go far, go together. This African proverb highlights the value of collaboration.
es: Si quieres ir rápido, ve solo. Si quieres ir lejos, ve juntos. Este proverbio africano resalta el valor de la colaboración.
ru: Если хочешь идти быстро, иди один. Если хочешь идти далеко, иди вместе. Эта африканская пословица подчеркивает ценность сотрудничества.

source: The only thing standing between you and your goal is the story you keep telling yourself. This quote by Jordan Belfort encourages self-belief.
es: Lo único que te separa de tu objetivo es la historia que sigues contándote a ti mismo. Esta cita de Jordan Belfort fomenta la autoconfianza.
ru: Единственное, что стоит между вами и вашей целью, – это история, которую вы постоянно себе рассказываете. Эта цитата Джордана Белфорта вдохновляет на веру в себя.

source: It is not the strongest of the species that survive, nor the most intelligent, but the one most responsive to change. This quote by Charles Darwin emphasizes adaptability.
es: No sobrevive el más fuerte ni el más inteligente de las especies, sino el que mejor se adapta al cambio. Esta cita de Charles Darwin enfatiza la importancia de la adaptabilidad.
ru: Выживает не самый сильный или самый умный вид, а тот, кто наиболее приспосабливается к изменениям. Эта цитата Чарльза Дарвина подчеркивает важность адаптивности.

source: Don’t watch the clock; do what it does. Keep going. This motivational quote by Sam Levenson encourages persistence.
es: No mires el reloj; haz lo que hace. Sigue adelante. Esta cita motivacional de Sam Levenson anima a la persistencia.
ru: Не смотри на часы; делай то, что они делают. Продолжай двигаться. Эта мотивационная цитата Сэма Левенсона призывает к настойчивости.

source: The greatest wealth is to live content with little. This quote by Plato reminds us that true wealth lies in contentment.
es: La mayor riqueza es vivir contento con lo poco. Esta cita de Platón nos recuerda que la verdadera riqueza radica en la satisfacción.
ru: Величайшее богатство – жить, довольствуясь малым. Эта цитата Платона напоминает нам, что истинное богатство заключается в удовлетворенности.

source: You must be the change you wish to see in the world. This quote by Mahatma Gandhi encourages proactive personal responsibility.
es: Debes ser el cambio que deseas ver en el mundo. Esta cita de Mahatma Gandhi promueve la responsabilidad personal activa.
ru: Ты должен быть тем изменением, которое хочешь видеть в мире. Эта цитата Махатмы Ганди призывает к активной личной ответственности.

source: The way to get started is to quit talking and begin doing. This quote by Walt Disney inspires action.
es: La manera de comenzar es dejar de hablar y empezar a hacer. Esta cita de Walt Disney inspira a la acción.
ru: Способ начать – это перестать говорить и начать делать. Эта цитата Уолта Диснея вдохновляет на действие.

source: The best and most beautiful things in the world cannot be seen or even touched—they must be felt with the heart. This quote by Helen Keller emphasizes the importance of emotional experiences.
es: Las mejores y más hermosas cosas del mundo no se pueden ver ni tocar; deben sentirse con el corazón. Esta cita de Helen Keller subraya la importancia de las experiencias emocionales.
ru: Лучшие и самые красивые вещи в мире нельзя увидеть или даже потрогать – их нужно почувствовать сердцем. Эта цитата Хелен Келлер подчеркивает важность эмоциональных переживаний.

source: Read this text or any text during 15-60 seconds
es: Lee este texto o cualquier otro durante 15-60 segundos.
ru: Прочитайте текст в обычном темпе (можно несколько раз) или любой другой в течение 15-60 секунд.

source: sample speech
es: muestra de discurso
ru: образец речи

source: Add the audio you want to change. You can simulate any accent and speed. For best results, use audio without noise.
es: Añade el audio que deseas cambiar. Puedes simular cualquier acento y velocidad. Para obtener los mejores resultados, utiliza audio sin ruido.
ru: Вы можете имитировать любой акцент и скорость. Для лучших результатов используйте аудио без шума.

source: Attach speech
es: Adjuntar discurso
ru: Прикрепить речь

source: changeable speech
es: discurso modificable
ru: изменяемая речь

source: Enter text for voice cloning. Use one language for words and phrases; transliterate words from other languages. (Maximal numbers of symbols is
es: Introduce el texto para la clonación de voz. Usa un solo idioma para palabras y frases; translitera palabras de otros idiomas. (El número máximo de símbolos es
ru: Введите текст для клонирования голоса. Используйте один язык для слов и фраз; транслитерируйте слова из других языков. (Максимальное количество символов —

source: but you can increase in settings
es: pero puedes aumentarlo en la configuración
ru: но вы можете увеличить это значение в настройках

source: clone voice
es: clonación de voz
ru: клонирование голоса

source: Record yourself or upload an audio clip to transform speech style into a cloned version. Make sure the recorded and sample voices match in style and language. Enhance your results by using noise reduction tools.
es: Graba tu voz o sube un clip de audio para transformar el estilo de la voz en una versión clonada. Asegúrate de que la voz grabada y la muestra coincidan en estilo e idioma. Mejora tus resultados utilizando herramientas de reducción de ruido.
ru: Запишите свой голос или загрузите аудиоклип, чтобы преобразовать стиль речи и акцент в клонированную версию. Убедитесь, что записанный голос и образец голоса совпадают. Улучшите свои результаты, используя инструмент шумоподавления (разделитель аудио).
