Repository: wladradchenko/wunjo.wladradchenko.ru
Catalog: portable/src/wunjo/translations/*/LC_MESSAGES/messages.po
Languages: es, ru

source: System is preparing
es: El sistema se está preparando
ru: Происходит подготовка системы

source: NOTE
es: NOTA
ru: ЗАМЕТКА

source: To ensure proper startup, run the application as
es: Para asegurar un inicio correcto, ejecute la aplicación como
ru: Для обеспечения корректного запуска запустите приложение от имени

source: Loading the necessary modules may take a few moments. Please wait while everything is being set up.
es: La carga de los módulos necesarios puede tomar unos momentos. Por favor, espere mientras se configura todo.
ru: Загрузка необходимых модулей может занять некоторое время. Пожалуйста, подождите, пока все компоненты не будут загружены.

source: Page not found
es: Página no encontrada
ru: Страница не найдена

source: Go to the App
es: Ir a la aplicación
ru: Вернуться

source: All rights reserved
es: Todos los derechos reservados
ru: Все права защищены

source: Navigation
es: Navegación
ru: Навигация

source: In this section, you can check the current version status or any update indications. Access the «Workspace» by clicking on it, where you’ll find various modules, settings, your profile, along with tutorials, contact information for the author, and news updates. Alternatively, clicking on «Wunjo» will display information about the ongoing processing tasks, known as the log.
es: En esta sección, puede verificar el estado actual de la versión o cualquier indicación de actualización. Acceda al «Espacio de trabajo» haciendo clic en él, donde encontrará varios módulos, configuraciones, su perfil, junto con tutoriales, información de contacto del autor y actualizaciones de noticias. Alternativamente, haciendo clic en «Wunjo» se mostrará información sobre las tareas de procesamiento en curso, conocidas como el registro.
ru: В этом разделе вы можете проверить текущий статус версии или любые признаки обновления. Нажмите на «Главная» и вы найдете различные модули, настройки, ваш профиль, а также руководства, контактную информацию автора и обновления новостей. В качестве альтернативы, нажав на «Wunjo», вы увидите информацию о текущих задачах обработки, известную как журнал.

source: Lite settings
es: Configuración simplificada
ru: Упрощенная настройка

source: Open settings. Customize the module to suit your needs. You can adjust the cache directory, switch processors, select the number of users and tasks, and much more. Be sure to review all the settings.
es: Abrir configuraciones. Personalice el módulo según sus necesidades. Puede ajustar el directorio de caché, cambiar procesadores, seleccionar la cantidad de usuarios y tareas, y mucho más. Asegúrese de revisar todas las configuraciones.
ru: Откройте настройки. Настройте модуль под свои нужды. Вы можете настроить каталог кэша, переключить процессоры, выбрать количество пользователей и задач и многое другое. Обязательно просмотрите все настройки.

source: The cache folder
es: La carpeta de caché
ru: Размер папки кэша

source: GB
ru: ГБ

source: click
es: haga clic
ru: открыть

source: size in settings. Downloaded models can occupy large amounts of disk space.
es: tamaño disponible en la configuración. Los modelos descargados pueden ocupar una gran cantidad de espacio en disco.
ru: доступен в настройках. Скачанные модели со временем могут занимать значительный объём диска.

source: Profile
es: Perfil
ru: Аккаунт

source: Settings
es: Configuraciones
ru: Настройки

source: FAQ
es: Preguntas Frecuentes
ru: ЧАВО

source: Live portrait
es: Retrato en vivo
ru: Живой портрет

source: Face swap
es: Intercambio de rostros
ru: Замена лица

source: Lip sync
es: Sincronización labial
ru: Синхронизация губ

source: Enhancement
es: Mejora
ru: Улучшение качества

source: Remove object
es: Eliminar objeto
ru: Удалить объект

source: Remove background
es: Eliminar fondo
ru: Удалить фон

source: Generation
es: Generación
ru: Генерация контента

source: Restyling
es: Restilización
ru: Рестайлинг контента

source: Clone voice
es: Clonar voz
ru: Клонировать голос

source: Separator
es: Separador
ru: Разделитель аудио

source: Workspace
es: Espacio de trabajo
ru: Рабочее пространство

source: By using Wunjo, you agree to the
es: Al usar Wunjo, usted acepta el
ru: Используя Wunjo, вы принимаете

source: EULA
es: Acuerdo de Licencia
ru: Лицензионное соглашение

source: and
es: y
ru: и

source: Privacy Policy
es: Política de Privacidad
ru: Политику конфиденциальности

source: Made by
es: Creado por
ru: Создано

source: What text should be read?
es: ¿Qué texto se debe leer?
ru: Какой текст следует озвучить?

source: The text might look a little lost in translation without a language chosen in the Parameters by Footer. Just sayin’. Now is set
es: El texto podría perderse un poco en la traducción sin un idioma seleccionado en los Parámetros por Pie de página. Solo digo. Ahora está configurado
ru: Обратите внимание, что вам необходимо выбрать язык в Footer настройках. Сейчас установлен

source: Apply
es: Aplicar
ru: Применить

source: Calendar
es: Calendario
ru: Календарь

source: You can select specific dates or date ranges to filter the content you have previously created.
es: Puede seleccionar fechas específicas o rangos de fechas para filtrar el contenido que ha creado previamente.
ru: Вы можете выбрать определенные даты или диапазоны дат, чтобы отфильтровать ранее созданный вами контент.

source: Today
es: Hoy
ru: Сегодня

source: Upload file
es: Subir archivo
ru: Загрузить файл

source: Drag and drop a file or select one. You can upload an audio. About module Clone Voice, look this
es: Arrastre y suelte un archivo o seleccione uno. Puede subir un archivo de audio. Sobre el módulo Clonar Voz, mire esto
ru: Перетащите файл или выберите его. Вы можете загрузить аудиофайл. Об этом модуле клонирования речи посмотрите

source: tutorial
ru: видеоурок

source: Briefly
es: Brevemente
ru: Кратко

source: All red blocks should turn green. Also, use the toggle and make sure to select the right clone language before pressing
es: Todos los bloques rojos deben volverse verdes. Además, use el interruptor y asegúrese de seleccionar el idioma de clonación correcto antes de presionar
ru: Все красные блоки должны стать зелеными. Также используйте переключатель и убедитесь, что выбран правильный язык клонирования перед нажатием

source: Date Created
es: Fecha de creación
ru: Дата создания

source: Control panel
es: Panel de control
ru: Панель управления

source: In the file manager, you have the ability to delete, open, and rename content. Additionally, you can utilize features such as redo, undo, refresh, and return to the home directory for efficient management of your files.
es: En el administrador de archivos, tiene la capacidad de eliminar, abrir y renombrar contenido. Además, puede utilizar funciones como rehacer, deshacer, actualizar y volver al directorio principal para una gestión eficiente de sus archivos.
ru: В файловом менеджере у вас есть возможность удалять, открывать и переименовывать контент. Кроме того, вы можете использовать такие функции, как повтор, отмена, обновление и возврат в домашний каталог для эффективного управления файлами.

source: Explore
es: Explorar
ru: Поиск

source: Content
es: Contenido
ru: Каталог

source: Open
es: Abrir
ru: Открыть

source: Rename
es: Renombrar
ru: Изменить

source: Delete
es: Eliminar
ru: Удалить

source: Option
es: Opción
ru: Опции

source: Manager view
es: Vista del administrador
ru: Файловый менеджер

source: In desktop mode, simply double-click on a folder or file to open it. In mobile mode, tap on the open button to access your folders and files. Let’s open some file in folder to display content.
es: En modo escritorio, simplemente haga doble clic en una carpeta o archivo para abrirlo. En modo móvil, toque el botón abrir para acceder a sus carpetas y archivos. Vamos a abrir algún archivo en la carpeta para mostrar el contenido.
ru: В режиме рабочего стола просто дважды щелкните по папке или файлу, чтобы открыть его. В мобильном режиме нажмите кнопку «Открыть», чтобы получить доступ к папкам и файлам. Давайте откроем какой-нибудь файл в папке, чтобы отобразить содержимое.

source: Filter
es: Filtro
ru: Фильтр

source: You can display specific types of content such as images, videos, audio, groups of images, or all content together.
es: Puede mostrar tipos específicos de contenido, como imágenes, videos, audio, grupos de imágenes o todo el contenido junto.
ru: Вы можете отображать определенные типы контента, такие как изображения, видео, аудио, группы изображений или весь контент вместе.

source: Drag and drop a file or select one. You can upload either a video or an image. For instructions on how to use the Enhancement module, check out this
es: Arrastre y suelte un archivo o seleccione uno. Puede cargar un video o una imagen. Para obtener instrucciones sobre cómo utilizar el módulo de mejora, consulte este
ru: Перетащите файл или выберите его. Вы можете загрузить видео или изображение. Для инструкций по использованию модуля улучшения качества, посмотрите этот

source: Upload file, and then press the
es: Cargar archivo, y luego presione el
ru: Загрузить файл

source: Suggest
es: Sugerir
ru: Идеи

source: Ready to give those lips some life? After swapping faces, it’s time to sync those pouts with the audio. Lip animation should always follow the face swap for maximum lip-syncing magic. Get ready to make those lips sing—right
es: ¿Listo para darle vida a esos labios? Después de intercambiar rostros, es hora de sincronizar esos labios con el audio. La animación de labios siempre debe seguir al intercambio de rostros para lograr la máxima magia de sincronización labial. Prepárese para hacer que esos labios canten—
ru: Перетащите файл или выберите его. Вы можете загрузить видео или изображение. Для инструкций по использованию модуля Live Portrait посмотрите это

source: here
es: aquí
ru: здесь

source: or
es: o
ru: или

source: Got a few facial quirks to iron out? No worries! If there are any imperfections, you’ve got the tools to smooth them out. Remember, a big gap in resolution between avatar face and target content can throw off the vibe. For optimal outcomes, ensure consistency in resolution, or utilize the facial enhancement tools available in this
es: ¿Tiene algunos rasgos faciales que necesita suavizar? ¡No se preocupe! Si hay imperfecciones, tiene las herramientas para suavizarlas. Recuerde, una gran diferencia en resolución entre la cara del avatar y el contenido objetivo puede afectar el ambiente. Para obtener resultados óptimos, asegúrese de la consistencia en la resolución o utilice las herramientas de mejora facial disponibles en este
ru: Нужно сгладить несколько черт лица? Не беспокойтесь! Если есть какие-то недостатки, у вас есть инструменты, чтобы сгладить их. Помните, большой разрыв в разрешении между лицом аватара и целевым контентом может испортить атмосферу. Для оптимальных результатов обеспечьте единообразие в разрешении или используйте инструменты улучшения лица, доступные в этом

source: module
es: módulo
ru: модуле

source: Drag and drop a file or select one. You can upload either a video or an image. For instructions on how to use the Face Swap module, check out this
es: Arrastre y suelte un archivo o seleccione uno. Puede cargar un video o una imagen. Para obtener instrucciones sobre cómo utilizar el módulo de intercambio de rostros, consulte este
ru: Перетащите файл или выберите его. Вы можете загрузить видео или изображение. Для инструкций по использованию модуля замены лица, посмотрите этот

source: All red blocks should turn green, and then press the
es: Todos los bloques rojos deben volverse verdes, y luego presione el
ru: Все красные блоки должны стать зелеными, а затем нажмите на

source: About
es: Acerca de
ru: Сведения

source: Your Content
es: Tu contenido
ru: Твой контент

source: Creating & Editing
es: Creación y edición
ru: Создание и редактирование

source: Subscriptions & Billing
es: Suscripciones y facturación
ru: Подписки и выставление счетов

source: Tech Issues
es: Problemas técnicos
ru: Технические проблемы

source: FREQUENTLY ASKED QUESTIONS
es: PREGUNTAS FRECUENTES
ru: ЧАСТО ЗАДАВАЕМЫЕ ВОПРОСЫ

source: What is Wunjo?
es: ¿Qué es Wunjo?
ru: Что такое Wunjo?

source: Wunjo is an idea-to-content platform that utilizes combinations of AI. There’s a lot of technical stuff involved, but basically, you reincarnation your content.
es: Wunjo es una plataforma de idea a contenido que utiliza combinaciones de IA. Hay muchas cosas técnicas involucradas, pero básicamente, reencarnas tu contenido.
ru: Wunjo — это платформа «идея-контент», которая использует комбинации ИИ. Здесь задействовано много технических вещей, но по сути вы реинкарнируете свой контент.

source: How does Wunjo work?
es: ¿Cómo funciona Wunjo?
ru: Как работает Wunjo?

source: I could tell you, but … you can find out this in open source code. Basically, this is magic. And this is uniq project! It doesn’t exist anywhere else on the market! I’m pretty darn excited about it!
es: Podría contártelo, pero ... puedes descubrirlo en el código abierto. Básicamente, esto es magia. ¡Y este es un proyecto único! ¡No existe en ningún otro lugar del mercado! ¡Estoy muy emocionado al respecto!
ru: Я мог бы рассказать вам, но ... вы можете узнать это в открытом исходном коде. По сути, это магия. И это уникальный проект! Он не существует больше нигде на рынке! Я чертовски взволнован этим

source: Do you have a publicly accessible API?
es: ¿Tiene una API accesible públicamente?
ru: Есть ли у вас общедоступный API?

source: Yes. You can use the application in API mode and connect it to your services.
es: Sí. Puedes usar la aplicación en modo API y conectarla a tus servicios.
ru: Да. Вы можете использовать приложение в режиме API и подключить его к своим сервисам.

source: It’s free?
es: ¿Es gratis?
ru: Это бесплатно?

source: Yes. The community edition version is absolutely free and you will able to find open source code. However, the professional version is available by subscription. This is a kind of reward to the author that he continues to develop the project, and gives you access so that you can use it in your projects and even freely earn money from the project, for example, using API or temporary links. The project is designed so that you can have your service in your pocket with minimal effort and without technical skills.
es: Sí. La versión de la edición comunitaria es absolutamente gratuita y puedes encontrar el código abierto. Sin embargo, la versión profesional está disponible por suscripción. Esto es una especie de recompensa al autor para que continúe desarrollando el proyecto y te da acceso para que puedas usarlo en tus proyectos e incluso ganar dinero con él, por ejemplo, usando la API o enlaces temporales. El proyecto está diseñado para que puedas tener tu servicio en tu bolsillo con un mínimo esfuerzo y sin habilidades técnicas.
ru: Да. Версия Community Edition абсолютно бесплатна, и вы сможете найти открытый исходный код. Однако профессиональная версия доступна по подписке. Это своего рода вознаграждение автору за то, что он продолжает развивать проект, и дает вам доступ, чтобы вы могли использовать его в своих проектах и ​​даже свободно зарабатывать на проекте, например, используя API или временные ссылки. Проект разработан таким образом, чтобы вы могли иметь свой сервис в своем кармане с минимальными усилиями и без технических навыков.

source: Can I use the content I made in Wunjo for commercial purposes?
es: ¿Puedo usar el contenido que creé en Wunjo con fines comerciales?
ru: Могу ли я использовать контент, созданный мной в Wunjo, в коммерческих целях?

source: It doesn’t matter if your content is created in a community edtiion version or a professional subscription. If it has nothing prohibited or is not intended to discredit anyone then, whatever you create using Wunjo can be used commercially, or non-commercially.
ru: Неважно, создан ли ваш контент в версии Community Edition или профессиональной подписке. Если в нем нет ничего запрещенного или он не направлен на дискредитацию кого-либо, то все, что вы создаете с помощью Wunjo, может быть использовано в коммерческих или некоммерческих целях.

source: Are the content I created in Wunjo private?
es: ¿El contenido que creo en Wunjo es privado?
ru: Является ли контент, созданный мной в Wunjo, конфиденциальным?

source: Yes. The content you create is completely private and stored on your device. Only you have access and you are responsible for the content you create.
es: Sí. El contenido que creas es completamente privado y se almacena en tu dispositivo. Solo tú tienes acceso y eres responsable del contenido que creas.
ru: Да. Создаваемый вами контент полностью конфиденциальен и хранится на вашем устройстве. Доступ есть только у вас, и вы несете ответственность за создаваемый вами контент.

source: What is the resolution of the content?
es: ¿Cuál es la resolución del contenido?
ru: Каково разрешение контента?

source: Baseline content output is Full HD and HD resolution. However, you customize the application yourself and can increase or decrease the resolution.
es: La salida de contenido base es en resolución Full HD y HD. Sin embargo, puedes personalizar la aplicación tú mismo y aumentar o disminuir la resolución.
ru: Базовый вывод контента — разрешение Full HD и HD. Однако вы можете настроить приложение самостоятельно и увеличить или уменьшить разрешение.

source: How do I improve quality of output content?
es: ¿Cómo puedo mejorar la calidad del contenido de salida?
ru: Как улучшить качество выходного контента?

source: Pay attention to the suggest option. When clicked, there will be a list of possible actions to improve the quality of the content received.
es: Presta atención a la opción de sugerencia. Al hacer clic, aparecerá una lista de posibles acciones para mejorar la calidad del contenido recibido.
ru: Обратите внимание на опцию идея. При нажатии на нее будет предложен список возможных действий по улучшению качества получаемого контента.

source: Can I increase videos or audio duration?
es: ¿Puedo aumentar la duración de los videos o audios?
ru: Могу ли я увеличить продолжительность видео или аудио?

source: Yes. You can freely change the basic settings, including the duration of the received content.
es: Sí. Puedes cambiar libremente las configuraciones básicas, incluida la duración del contenido recibido.
ru: Да. Вы можете свободно изменять основные настройки, включая длительность получаемого контента.

source: Can I improve application performance?
es: ¿Puedo mejorar el rendimiento de la aplicación?
ru: Могу ли я улучшить производительность приложения?

source: Yes. In the settings, pay attention to the parameters for video memory, RAM, and the number of simultaneously running tasks. You determine the performance of the application for yourself based on your needs and your device. You can tighten the settings so you can do other things on your device at the same time, or loosen them so the app uses more of your device’s resources.
es: Sí. En la configuración, presta atención a los parámetros de memoria de video, RAM y el número de tareas que se ejecutan simultáneamente. Tú determinas el rendimiento de la aplicación según tus necesidades y tu dispositivo. Puedes ajustar la configuración para hacer otras cosas en tu dispositivo al mismo tiempo o aflojarlas para que la aplicación use más recursos de tu dispositivo.
ru: Да. В настройках обратите внимание на параметры видеопамяти, оперативной памяти и количество одновременно запущенных задач. Вы сами определяете производительность приложения, исходя из своих потребностей и возможностей устройства. Вы можете ужесточить настройки, чтобы одновременно заниматься другими делами на устройстве, или ослабить их, чтобы приложение использовало больше ресурсов вашего устройства.

source: Can I turn off my internet connection?
es: ¿Puedo desconectar mi conexión a internet?
ru: Могу ли я отключить интернет-соединение?

source: Yes. You can disable your internet connection, but you will need to make sure that all the required models for your module are downloaded and the page code is loaded into the cache. You can do this in the settings, as well as following the instructions for manually downloading models. When first run, the models are downloaded automatically, and if the generation is successful, then the model update is no longer checked. However, in the settings you can choose to check for model updates. Anyway, please note that the Internet is required to verify the license and obtain the closed part of the code, which is licensed under a license other than the public one and after verified you can turn off internet connection.
es: Sí. Puedes desactivar tu conexión a Internet, pero debes asegurarte de que todos los modelos requeridos para tu módulo estén descargados y que el código de la página esté cargado en la caché. Puedes hacerlo en la configuración, así como siguiendo las instrucciones para descargar los modelos manualmente. Al primer inicio, los modelos se descargan automáticamente, y si la generación es exitosa, ya no se verifica la actualización del modelo. Sin embargo, en la configuración puedes optar por verificar las actualizaciones de los modelos. De todos modos, ten en cuenta que se requiere Internet para verificar la licencia y obtener la parte cerrada del código, que está bajo una licencia distinta a la pública, y después de la verificación, puedes desactivar la conexión a Internet.
ru: Да и нет. Вы не можете отключить интернет-соединение для профессиональной версии. Вам оно потребуется для загрузки моделей и проверки лицензий. В бесплатной версии, вы можете это сделать после загрузки всех моделей.

source: How long does the subscription last?
es: ¿Cuánto dura la suscripción?
ru: Как долго действует подписка?

source: Depending on the plan you choose. The subscription is counted from the time of purchase. And when it stops, you will receive a notification.
es: Depende del plan que elijas. La suscripción se cuenta desde el momento de la compra. Y cuando termine, recibirás una notificación.
ru: В зависимости от выбранного вами плана. Подписка отсчитывается с момента покупки. И когда она прекратится, вы получите уведомление.

source: How do I cancel my subscription?
es: ¿Cómo cancelo mi suscripción?
ru: Как отменить подписку?

source: Email us at support@wunjo.online if you really want to say goodbye to your subsription. Please note that if you have an active subscription, and you take this step, your subscription will be invalidated, and no refund will be provided.
es: Envíanos un correo a support@wunjo.online si realmente deseas cancelar tu suscripción. Ten en cuenta que si tienes una suscripción activa y das este paso, tu suscripción será anulada y no se proporcionará un reembolso.
ru: Напишите нам на support@wunjo.online, если вы действительно хотите попрощаться со своей подпиской. Обратите внимание, что если у вас есть активная подписка, и вы сделаете этот шаг, ваша подписка будет аннулирована, и возврат средств не будет предоставлен.

source: Can my subscription be blocked?
es: ¿Puede bloquearse mi suscripción?
ru: Может ли моя подписка быть заблокирована?
