Repository: wladradchenko/wunjo.wladradchenko.ru
Catalog: portable/src/wunjo/translations/*/LC_MESSAGES/messages.po
Languages: es, ru

source: No. However, if your unique address is noticed to change frequently, with each suspicious activity, you will be asked to confirm that it is you to continue the session and gain access to the professional subscription, otherwise the community edition version will open.
es: No. Sin embargo, si se observa que tu dirección única cambia con frecuencia con cada actividad sospechosa, se te pedirá que confirmes que eres tú para continuar la sesión y acceder a la suscripción profesional, de lo contrario, se abrirá la versión de la edición comunitaria.
ru: Да. Если будет замечено, что ваш уникальный адрес часто меняется при каждой подозрительной активности, вам будет предложено подтвердить, что это вы, чтобы продолжить сеанс и получить доступ к профессиональной подписке, в противном случае откроется версия Community Edition. Дополнительно, если вы нарушаете EULA ваша подписка модет быть заблокирована.

source: If I start a subscription, is it just for during period, or will it renew automatically?
es: Si inicio una suscripción, ¿es solo por un período determinado o se renovará automáticamente?
ru: Если я оформлю подписку, она будет действовать только в течение определенного периода или будет продлеваться автоматически?

source: Not. This will not be automatically renew every period, so you don’t have to worry about anything. You only receive a notification that your subscription has ended.
es: No. Esta no se renovará automáticamente cada período, por lo que no tienes que preocuparte por nada. Solo recibirás una notificación de que tu suscripción ha terminado.
ru: Зависит от платформы, где совершена покупка.

source: What is the difference between Professional and Community Edition?
es: ¿Cuál es la diferencia entre la edición profesional y la edición comunitaria?
ru: В чем разница между Professional Edition и Community Edition?

source: You can find out more at
es: Puedes obtener más información en
ru: Ознакомиться с различием Professional Edition и Community Edition вы cможете на

source: Why do you charge money?
es: ¿Por qué cobran dinero?
ru: Почему вы берете деньги?

source: Believe it or not, each time you click generate, it’s the result of countless sleepless nights and hours of dedicated development. Subscribing to the professional version is a way to support the author’s hard work and motivate ongoing project development, including the addition of new features and enhancements to existing ones.
es: Créelo o no, cada vez que haces clic en generar, es el resultado de innumerables noches de insomnio y horas de desarrollo dedicado. Suscribirse a la versión profesional es una manera de apoyar el arduo trabajo del autor y motivar el desarrollo continuo del proyecto, incluyendo la adición de nuevas funciones y mejoras a las existentes.
ru: Поверьте или нет, но каждый раз, когда вы нажимаете на кнопку генерации, это результат бесчисленных бессонных ночей и часов преданной работы. Подписка на профессиональную версию — это способ поддержать усердную работу автора и мотивировать дальнейшее развитие проекта, включая добавление новых функций и улучшение существующих.

source: Moreover, the author has designed the application not only for your personal use but also to enable you to share access with friends or integrate the API into your projects. This means you can leverage all the application’s features freely, even for commercial purposes.
es: Además, el autor ha diseñado la aplicación no solo para tu uso personal, sino también para que puedas compartir el acceso con amigos o integrar el API en tus proyectos. Esto significa que puedes aprovechar todas las funciones de la aplicación libremente, incluso para fines comerciales.
ru: Кроме того, автор создал приложение не только для вашего личного использования, но и для того, чтобы вы могли делиться доступом с друзьями или интегрировать API в свои проекты. Это означает, что вы можете свободно использовать все функции приложения, даже в коммерческих целях.

source: Your subscription directly contributes to the continued improvement and sustainability of the project, ensuring you receive the best possible experience. Thank you for supporting this work!
es: Tu suscripción contribuye directamente a la mejora continua y la sostenibilidad del proyecto, asegurando que recibas la mejor experiencia posible. ¡Gracias por apoyar este trabajo!
ru: Ваша подписка напрямую способствует продолжению улучшения и устойчивости проекта, обеспечивая вам лучший возможный опыт. Спасибо за поддержку этой работы!

source: What if I have questions that aren’t answered here?
es: ¿Qué hacer si tengo preguntas que no se responden aquí?
ru: Что делать, если у меня есть вопросы, на которые здесь нет ответов?

source: Head over to the support channel on
es: Dirígete al canal de soporte en
ru: Перейдите в канал поддержки на

source: and say hi to the community while you’re there! There’s also a really robust FAQ section there that may have exactly the answer you need. If you have any questions, you can contact the author or
es: y saluda a la comunidad mientras estés allí. También hay una sección de preguntas frecuentes muy completa que puede tener exactamente la respuesta que necesitas. Si tienes alguna pregunta, puedes contactar al autor o escribir a
ru: и поздоровайтесь с сообществом! Там также есть очень полезный раздел с часто задаваемыми вопросами, который может содержать именно тот ответ, который вам нужен. Если у вас есть вопросы, вы можете связаться с автором или написать на

source: What is your prompt?
es: ¿Cuál es tu solicitud?
ru: Ваша подсказка?

source: e.g.
es: p.ej.
ru: напр.

source: Negative prompt
es: Solicitud negativa
ru: Запрос на исключение

source: e.g. ugly, bad, terrible (optional)
es: p.ej., feo, malo, terrible (opcional)
ru: напр., уродливый, плохой, ужасный (необязательно)

source: Generation settings
es: Configuraciones de generación
ru: Параметры генерации

source: You can either fine-tune the parameters to
es: Puedes ajustar los parámetros para
ru: Вы можете либо настроить параметры для

source: generate
es: generar
ru: генерации

source: video or take control by manually
es: video o tomar el control manualmente
ru: видео, либо взять управление в свои руки, чтобы вручную

source: redraw
es: redibujar
ru: перерисовывать

source: tweaking the elements within the image before creation. Dive in and make it truly yours.
es: ajustando los elementos dentro de la imagen antes de la creación. Sumérgete y hazlo verdaderamente tuyo.
ru: элементы внутри изображения перед его созданием. Погружайтесь и сделайте это по-настоящему вашим.

source: You can manually
es: Puedes manualmente
ru: Вы можете вручную

source: tweaking the elements within the image. Dive in and make it truly yours.
es: ajustar los elementos dentro de la imagen. Sumérgete y hazlo verdaderamente tuyo.
ru: элементы внутри изображения. Погружайтесь и сделайте это по-настоящему вашим.

source: Redraw
es: Redibujar
ru: Перерисовать

source: Generate
es: Generar
ru: Генерация

source: CUSTOMIZING GENERATION
es: MODIFICACIÓN DE LA GENERACIÓN
ru: Модификация генерации

source: Prepare your staff. Select an object and scene, set parameters and properties, and change it by prompt. Additionally, you can regenerate the image again, or replace it with another one.
es: Seleccione un objeto y escena, configure parámetros y propiedades, y cámbielos con una instrucción. Además, puede regenerar la imagen o reemplazarla por otra.
ru: Выберите объект и сцену, задайте параметры и свойства и измените их по подсказке. Кроме того, вы можете повторно сгенерировать изображение или заменить его другим.

source: Image input
es: Entrada de imagen
ru: Изображение

source: Generation... Buttons are locked until finished. Tap on the screen to view details.
es: Generación... Los botones están bloqueados hasta que termine. Toque la pantalla para ver los detalles.
ru: Генерация... Кнопки заблокированы до завершения. Нажмите на экран, чтобы просмотреть подробности.

source: Positive prompt
es: Instrucción positiva
ru: Запрос

source: Describe the change you want to make
es: Describa el cambio que desea realizar
ru: Опишите изменение, которое вы хотите внести

source: Inspire me
es: Inspírame
ru: Удиви меня

source: Blur factor
es: Factor de desenfoque
ru: Фактор размытия

source: Continue
es: Continuar
ru: Продолжить

source: Please note that the model used is version 1.5 with a resolution limit of 1280x1280 for best quality.
es: Tenga en cuenta que el modelo utilizado es la versión 1.5 con un límite de resolución de 1280x1280 para obtener la mejor calidad.
ru: Обратите внимание, что используется модель версии 1.5 с ограничением разрешения 1280x1280 для наилучшего качества.

source: Prompt
es: Instrucción
ru: Запрос

source: (Optional) Describe what should be in the new parts
es: (Opcional) Describa lo que debería estar en las nuevas partes
ru: (Необязательно) Опишите, что должно быть в новых деталях

source: So, you’ve created the video. But wait, high-resolution from source content can sometimes reveal a few sneaky flaws. No sweat! Enhancement
es: Entonces, ha creado el video. Pero espere, el contenido de alta resolución a veces puede revelar algunos defectos ocultos. ¡No se preocupe! La mejora...
ru: Итак, вы создали видео. Но подождите, высокое разрешение исходного контента иногда может выявить некоторые скрытые дефекты. Не переживайте! Улучшение качества...

source: tools
es: herramientas
ru: инструменты

source: are here to smooth out those rough spots.
es: están aquí para suavizar esas asperezas.
ru: здесь, чтобы сгладить эти неровности.

source: Lost a face in the content? It can be restored with a
es: ¿Perdió una cara en el contenido? Se puede restaurar con un
ru: Потеряли лицо в контенте? Его можно восстановить с помощью

source: face swap
es: intercambio de caras
ru: замены лица

source: by one click.
es: con un solo clic.
ru: одним кликом.

source: Upload file or input text
es: Sube un archivo o introduce texto
ru: Загрузите файл или введите текст

source: Drag and drop a file or select one. You can upload an image or use input for a text. For instructions on how to use the Generation module, check out this
es: Arrastra y suelta un archivo o selecciona uno. Puedes subir una imagen o utilizar la entrada para texto. Para instrucciones sobre cómo usar el módulo de generación, consulta este
ru: Перетащите файл или выберите его. Вы можете загрузить изображение или использовать ввод для текста. Для инструкций по использованию модуля генерации контента, посмотрите этот

source: Use an image or a text, and then press the
es: Utiliza una imagen o un texto, y luego presiona el botón
ru: Используйте изображение или текст, а затем нажмите кнопку

source: Switch view
es: Cambiar vista
ru: Переключатель

source: Switch to content to view your data. Each user can see the content they previously created based on their IP address.
es: Cambia a contenido para ver tus datos. Cada usuario puede ver el contenido que creó anteriormente basado en su dirección IP.
ru: Переключитесь на контент, чтобы просмотреть свои данные. Каждый пользователь может видеть контент, который он ранее создал на основе своего IP-адреса.

source: Smart search
es: Búsqueda inteligente
ru: Умный поиск

source: For advanced tasks, utilize the smart search feature. Discover recommendations like
es: Para tareas avanzadas, utiliza la función de búsqueda inteligente. Descubre recomendaciones como
ru: Для более сложных задач используйте функцию умного поиска. Откройте для себя рекомендации, такие как

source: record a song fragment with a cloned voice
es: grabar un fragmento de canción con una voz clonada
ru: записать фрагмент песни с клонированным голосом

source: analysis content
es: análisis de contenido
ru: анализ контента

source: create a talking person from scratch
es: crear una persona que hable desde cero
ru: создать говорящего человека с нуля

source: and etc. If you don’t find the help you need, contact to at support@wunjo.online.
es: y más. Si no encuentras la ayuda que necesitas, contáctanos en support@wunjo.online.
ru: и другие. Если вы не нашли нужную помощь, свяжитесь с нами по адресу support@wunjo.online.

source: Additionally, explore
es: Además, explora
ru: Кроме того, ознакомьтесь с

source: for exclusive video tutorials to master advanced features.
es: para tutoriales en video exclusivos para dominar funciones avanzadas.
ru: для эксклюзивных видеоруководств по освоению продвинутых функций.

source: What can I help with? (Any language)
es: ¿En qué puedo ayudar? (En cualquier idioma)
ru: Чем я могу помочь? (На любом языке)

source: Quick tips for best results
es: Consejos rápidos para mejores resultados
ru: Быстрые рекомендации

source: Each module includes easy-to-follow tips to help you achieve the best quality outcomes. Start here for straightforward guidance tailored to your needs.
es: Cada módulo incluye consejos fáciles de seguir para ayudarte a lograr los mejores resultados de calidad. Comienza aquí para obtener orientación sencilla adaptada a tus necesidades.
ru: Каждый модуль включает простые в использовании советы, которые помогут вам достичь наилучших качественных результатов. Начните здесь, чтобы получить простые рекомендации, соответствующие вашим потребностям.

source: Generation content
es: Contenido de generación
ru: Генерация контента

source: Restyling visual
ru: Рестайлинг контента

source: Audio separator
es: Separador de audio
ru: Разделитель аудио

source: Model select
es: Selección de modelo
ru: Выбор модели

source: Fast Method
es: Método rápido
ru: Быстрый метод

source: This method is quicker, but the lips might appear inaccurate and blurred. You can enhance the quality using the Enhancement module.
es: Este método es más rápido, pero los labios pueden aparecer inexactos y borrosos. Puedes mejorar la calidad utilizando el módulo de mejora.
ru: Метод быстрее, но губы могут быть с неточными движениями и размытыми.Вы можете улучшить качество с помощью модуля улучшения качества.

source: Fast
es: Rápido
ru: Быстро

source: Latent Diffusion Method
es: Método de difusión latente
ru: Метод скрытой диффузии

source: This provides more accurate results and visually appealing lip animations, though the face might occasionally twitch and the mouth may not fully close.
es: Este método proporciona resultados más precisos y animaciones de labios visualmente atractivas, aunque el rostro puede moverse ocasionalmente y la boca puede no cerrarse completamente.
ru: Метод обеспечивает более точные результаты и визуально привлекательные анимации губ, однако лицо может иногда дергаться, а рот не всегда полностью закрываться.

source: Best
es: Mejor
ru: Качествено

source: So, you’ve animated those lips. But you think the animation of the lips is not natural? Try, if the original video, processing it in live portrait mode silence, to make the mouth closed in
es: Entonces, has animado esos labios. ¿Pero crees que la animación de los labios no es natural? Intenta procesar el video original en modo retrato en vivo con silencio, para cerrar la boca en
ru: Итак, вы анимировали губы. Но вам кажется, что анимация губ неестественная? Попробуйте обработать исходное видео в режиме живого портрета в режиме «тишина, чтобы закрыть рот в

source: and came back to lip sync after.
es: y luego vuelve a la sincronización de labios después.
ru: и затем вернитесь к синхронизации губ.

source: Got some extra lip action going on? Say goodbye to noisy audio and hello to separate vocals and music accompaniment in
es: ¿Tienes algunos movimientos extra de labios? Despídete del audio ruidoso y di hola a las voces separadas y el acompañamiento musical en
ru: Много лишних движений губ? Попрощайтесь с шумным аудио и скажите привет отдельным вокалам и музыкальному сопровождению в

source: It’s like magic to improve your lip sync!
es: ¡Es como magia para mejorar tu sincronización de labios!
ru: Почти как магия для улучшения синхронизации губ!

source: Drag and drop a file or select one. You can upload either a video or an image. For instructions on how to use the Lip Sync module, check out this
es: Arrastra y suelta un archivo o selecciona uno. Puedes cargar un video o una imagen. Para instrucciones sobre cómo usar el módulo de sincronización de labios, consulta esto
ru: Перетащите файл или выберите его. Вы можете загрузить видео или изображение.Для инструкций по использованию модуля синхронизации губ, посмотрите этот

source: For better video, use the «silence» mode in
es: Para un mejor video, utiliza el modo «silencio» en
ru: Для лучшего видео используйте режим «тишина» в

source: manually retargeting live portrait
es: redireccionamiento manual de retrato en vivo
ru: ручная манипуляция с портретом

source: to pre-process the mouth to a closed state before applying lip sync.
es: para preprocesar la boca a un estado cerrado antes de aplicar la sincronización de labios.
ru: для предварительной обработки рта в закрытое состояние перед применением синхронизации губ.

source: Choose how often the effect is applied to the frames: a higher number applies it less frequently, while a lower number applies it more often.
es: Elige con qué frecuencia se aplica el efecto a los cuadros: un número más alto lo aplica con menos frecuencia, mientras que un número más bajo lo aplica con más frecuencia.
ru: Выберите, как часто эффект будет применяться к кадрам: большее число применяет эффект реже, меньшее число применяет его чаще.

source: Frequency
es: Frecuencia
ru: Частота

source: Set the lower and upper thresholds for actions. Adjust values to achieve the desired accuracy.
es: Establece los umbrales inferior y superior para las acciones. Ajusta los valores para lograr la precisión deseada.
ru: Установите нижний и верхний пороги для движений. Отрегулируйте значения для достижения желаемой точности.

source: Range
es: Rango
ru: Диапазон

source: Smooth action on all frames
es: Acción suave en todos los cuadros
ru: Сгладить действия на всех кадрах

source: Submit
es: Enviar
ru: Принять

source: CUSTOMIZING FRAMES
es: PERSONALIZANDO CUADROS
ru: Модификация кадров

source: Prepare your staff. Select an object and scene, set parameters and properties, and change face movement. When you are satisfied with the result, move on to the next frame.
es: Prepara tu contenido. Selecciona un objeto y una escena, configura los parámetros y propiedades, y cambia el movimiento de la cara. Cuando estés satisfecho con el resultado, pasa al siguiente cuadro.
ru: Подготовьте ваш контент. Выберите объект и сцену, настройте параметры и свойства, а также измените движения лица. Когда вы будете довольны результатом, переходите к следующему кадру.

source: Qick
es: Rápido
ru: Быстро

source: Retargeting... Buttons are locked until finished. Tap on the screen to view details.
es: Reorientando... Los botones están bloqueados hasta que se termine. Toca en la pantalla para ver los detalles.
ru: Ретаргетинг... Кнопки заблокированы до завершения. Нажмите на экран, чтобы просмотреть подробности.

source: Eye ratio
es: Proporción de ojos
ru: Соотношение глаз

source: Lip ratio
es: Proporción de labios
ru: Соотношение губ

source: Pitch
es: Inclinación
ru: Тангаж

source: Yaw
es: Giro
ru: Рыскание

source: Roll
es: Rolido
ru: Крен

source: Eyeball X
es: Ojo X
ru: Глаза X

source: Eyeball Y
es: Ojo Y
ru: Глаза Y

source: Head X
es: Cabeza X
ru: Голова X

source: Head Y
es: Cabeza Y
ru: Голова Y

source: Head Z
es: Cabeza Z
ru: Голова Z

source: Smile
es: Sonrisa
ru: Улыбка

source: Wink
es: Guiño
ru: Подмигивание

source: Eyebrow
es: Cejas
ru: Брови

source: Grin
es: Sonrisa burlona
ru: Ухмылка

source: Pursing
es: Fruncir labios
ru: Поджимание губ

source: Pouting
es: Hacer morros
ru: Надувание губ

source: Lip expression
es: Expresión de labios
ru: Закрытость рта

source: Back
es: Atrás
ru: Назад

source: Drag and drop a file or select one. You can upload either a video or an image. For instructions on how to use the Live Portrait module, check out this
es: Arrastra y suelta un archivo o selecciona uno. Puedes cargar un video o una imagen. Para instrucciones sobre cómo usar el módulo de Retrato Vivo, consulta esto
ru: Перетащите файл или выберите его. Вы можете загрузить видео или изображениеДля инструкций по использованию модуля оживить портерт посмотрите этот

source: New features alert! Soon!
es: ¡Nuevas funciones pronto!
ru: Ещё больше возможностей? Уже здесь!

source: To learn more project, check out
es: Para saber más sobre el proyecto, consulta
ru: Чтобы узнать больше о проекте, посетите

source: YouTube channel
es: Canal de YouTube
ru: YouTube канал

source: We’re
es: Estamos
ru: Мы

source: looking
es: buscando
ru: рады

source: for different support!
es: ¡todo tipo de soporte!
ru: любой поддержке!

source: Ready to use Wunjo v2?
es: ¿Listo para usar Wunjo v2?
ru: Готовы использовать Wunjo v2?

source: Let’s Go!
es: ¡Vamos!
ru: Поехали!

source: By signing in, you are agreeing to the
es: Al iniciar sesión, aceptas los
ru: Используя этот сайт, вы принимаете

source: End-User License Agreement
es: Acuerdo de licencia de usuario final
ru: Условия использования

source: Author
es: Autor
ru: Автор

source: Attention
es: Atención
ru: Внимание

source: IMPORTANT
es: IMPORTANTE
ru: ВАЖНО

source: The CUDA driver is not detected. If you proceed with the installation, the program will run on the CPU, resulting in
es: No se detectó el controlador CUDA. Si continúas con la instalación, el programa se ejecutará en la CPU, lo que resultará en
ru: Драйвер CUDA не обнаружен. Если вы продолжите установку, программа будет работать на процессоре, что приведет к

source: significantly slower performance
es: un rendimiento significativamente más lento
ru: начительному снижению производительности

source: for some functions, and others may not work at all. To enable GPU acceleration,
es: para algunas funciones, y otras pueden no funcionar en absoluto. Para habilitar la aceleración de GPU,
ru: для некоторых функций, а другие могут не работать вовсе. Чтобы включить ускорение с помощью GPU,

source: please install
es: por favor, instala
ru: пожалуйста, установите

source: the necessary
es: los controladores necesarios
ru: необходимые драйверы

source: drivers and restart Wunjo.
es: y reinicia Wunjo.
ru: и перезапустите Wunjo.

source: Loading
es: Cargando
ru: Загрузка

source: Anyway install
es: Instalar de todos modos
ru: Установить

source: Welcome
es: Bienvenido
ru: Добро пожаловать

source: Welcome to Wunjo! To get started, essential drivers will need to be installed. Click
es: ¡Bienvenido a Wunjo! Para comenzar, se deben instalar los controladores esenciales. Haz clic
ru: Для начала необходимо установить основные драйверы. Нажмите

source: Installation
es: Instalar
ru: Установить

source: to proceed.
es: , para continuar.
ru: , чтобы продолжить.

source: It appears that you have CUDA installed, but it’s an outdated version. Please update CUDA to version 12.4 or higher and install cuDNN 9.x to take advantage of GPU acceleration.
es: Parece que tienes CUDA instalado, pero es una versión desactualizada. Por favor, actualiza CUDA a la versión 12.4 o superior e instala cuDNN 9.x para aprovechar la aceleración por GPU.
ru: Кажется, у вас установлен CUDA, но это устаревшая версия. Обновите CUDA до версии 12.4 или выше и установите cuDNN версии 9.x, чтобы воспользоваться ускорением на GPU.

source: Not found large packages
es: No se encontraron paquetes grandes
ru: Не найдено больших пакетов

source: Preload
es: Precarga
ru: Предварительная загрузка
