{"format": "graph-model", "generatedBy": "2.4.0", "convertedBy": "TensorFlow.js Converter v2.0.0", "userDefinedMetadata": {"signature": {"inputs": {"input_res_context:0": {"name": "input_res_context:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "192"}]}}, "input_res_text:0": {"name": "input_res_text:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "192"}]}}, "input_inp_text:0": {"name": "input_inp_text:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "192"}]}}}, "outputs": {"Final/EncodeQuery/mul:0": {"name": "Final/EncodeQuery/mul:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}]}}, "Final/EncodeResult/mul:0": {"name": "Final/EncodeResult/mul:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}]}}}}}, "modelTopology": {"node": [{"name": "Final/EncodeQuery/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Final/EncodeQuery/l2_normalize/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Final/EncodeQuery/l2_normalize/Maximum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inp_text/res_text/EncodeQuery/tanh_layer_0/dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "220"}, {"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inp_text/res_text/EncodeQuery/tanh_layer_0/dense/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}}}, {"name": "inp_text/res_text/EncodeQuery/tanh_layer_1/dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inp_text/res_text/EncodeQuery/tanh_layer_1/dense/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}}}, {"name": "inp_text/res_text/EncodeQuery/tanh_layer_2/dense/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "100"}]}}}}}, {"name": "inp_text/res_text/EncodeQuery/tanh_layer_2/dense/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/reduce_all_tokens/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/FFN/conv2/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/FFN/conv2/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/FFN/conv2/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/FFN/conv2/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/FFN/conv1/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/FFN/conv1/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/FFN/conv1/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/FFN/conv1/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Mean_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/FFN/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/FFN/conv1/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/FFN/conv1/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/FFN/conv1/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/FFN/conv1/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/FFN/conv2/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/FFN/conv2/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/FFN/conv2/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/FFN/conv2/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/to_3d/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/to_3d/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/to_3d/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/to_3d/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/to_3d/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/to_3d_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/to_3d_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/to_3d_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/to_3d_1/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/to_3d_1/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/Reshape/shape/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads_1/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/attention_bias_ignore_padding/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/attention_bias_ignore_padding/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/attention_bias_ignore_padding/ExpandDims_1/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/layer_prepostprocess/layer_norm/Mean_1/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/layer_prepostprocess/layer_norm/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/layer_prepostprocess/layer_norm/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/to_3d_2/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/to_3d_2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/to_3d_2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/to_3d_2/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/to_3d_2/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/split_heads_2/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/combine_heads/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/to_2d/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/to_2d/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/to_2d/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/to_2d/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_2/TransformerLayer/MultiheadAttention/to_2d/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Mean_1/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/FFN/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/to_3d/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/to_3d/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/to_3d/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/to_3d/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/to_3d/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/to_3d_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/to_3d_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/to_3d_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/to_3d_1/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/to_3d_1/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_1/split_last_dimension/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/attention_bias_ignore_padding/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/attention_bias_ignore_padding/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/attention_bias_ignore_padding/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/layer_prepostprocess/layer_norm/Mean_1/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/layer_prepostprocess/layer_norm/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/layer_prepostprocess/layer_norm/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/to_3d_2/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/to_3d_2/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/to_3d_2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/to_3d_2/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/to_3d_2/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_2/split_last_dimension/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads_2/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/combine_heads/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/to_2d/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/to_2d/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/to_2d/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/to_2d/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/to_2d/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/FFN/conv2/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/FFN/conv2/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/FFN/conv2/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/FFN/conv2/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/FFN/conv1/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/FFN/conv1/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/FFN/conv1/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/FFN/conv1/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Mean_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/FFN/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/FFN/conv1/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/FFN/conv1/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/FFN/conv1/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/FFN/conv1/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/FFN/conv2/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/FFN/conv2/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/FFN/conv2/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/FFN/conv2/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/to_3d/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/to_3d/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/to_3d/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/to_3d/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/to_3d/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/to_3d_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/to_3d_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/to_3d_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inp_text/EncodeFeature/Transformer/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/to_3d_1/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": 